Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0xa27 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 24 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0xf0ba8): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0xa6b4c): ../Core/Src/freertos.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x3956d): C:/Users/kaur_/Downloads/KTH/PRO1_Chandadeep_Kaur/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 25 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 6 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 4
    <33>   DW_AT_encoding    : 7	(unsigned)
    <34>   DW_AT_name        : (indirect string, offset: 0x13e97): unsigned int
 <1><38>: Abbrev Number: 6 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x6ef50): long long int
 <1><3f>: Abbrev Number: 6 (DW_TAG_base_type)
    <40>   DW_AT_byte_size   : 8
    <41>   DW_AT_encoding    : 4	(float)
    <42>   DW_AT_name        : (indirect string, offset: 0x165f4): long double
 <1><46>: Abbrev Number: 6 (DW_TAG_base_type)
    <47>   DW_AT_byte_size   : 1
    <48>   DW_AT_encoding    : 6	(signed char)
    <49>   DW_AT_name        : (indirect string, offset: 0x7aed6): signed char
 <1><4d>: Abbrev Number: 4 (DW_TAG_typedef)
    <4e>   DW_AT_name        : (indirect string, offset: 0x465ad): __uint8_t
    <52>   DW_AT_decl_file   : 2
    <53>   DW_AT_decl_line   : 43
    <54>   DW_AT_decl_column : 24
    <55>   DW_AT_type        : <0x59>
 <1><59>: Abbrev Number: 6 (DW_TAG_base_type)
    <5a>   DW_AT_byte_size   : 1
    <5b>   DW_AT_encoding    : 8	(unsigned char)
    <5c>   DW_AT_name        : (indirect string, offset: 0xec597): unsigned char
 <1><60>: Abbrev Number: 6 (DW_TAG_base_type)
    <61>   DW_AT_byte_size   : 2
    <62>   DW_AT_encoding    : 5	(signed)
    <63>   DW_AT_name        : (indirect string, offset: 0xb5a7e): short int
 <1><67>: Abbrev Number: 6 (DW_TAG_base_type)
    <68>   DW_AT_byte_size   : 2
    <69>   DW_AT_encoding    : 7	(unsigned)
    <6a>   DW_AT_name        : (indirect string, offset: 0xeaa72): short unsigned int
 <1><6e>: Abbrev Number: 6 (DW_TAG_base_type)
    <6f>   DW_AT_byte_size   : 4
    <70>   DW_AT_encoding    : 5	(signed)
    <71>   DW_AT_name        : (indirect string, offset: 0x1495d): long int
 <1><75>: Abbrev Number: 4 (DW_TAG_typedef)
    <76>   DW_AT_name        : (indirect string, offset: 0x9bfd5): __uint32_t
    <7a>   DW_AT_decl_file   : 2
    <7b>   DW_AT_decl_line   : 79
    <7c>   DW_AT_decl_column : 25
    <7d>   DW_AT_type        : <0x81>
 <1><81>: Abbrev Number: 6 (DW_TAG_base_type)
    <82>   DW_AT_byte_size   : 4
    <83>   DW_AT_encoding    : 7	(unsigned)
    <84>   DW_AT_name        : (indirect string, offset: 0x5cb20): long unsigned int
 <1><88>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <89>   DW_AT_type        : <0x81>
 <1><8d>: Abbrev Number: 6 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 8
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x3297a): long long unsigned int
 <1><94>: Abbrev Number: 4 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x465af): uint8_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x4d>
 <1><a0>: Abbrev Number: 13 (DW_TAG_const_type)
    <a1>   DW_AT_type        : <0x94>
 <1><a5>: Abbrev Number: 4 (DW_TAG_typedef)
    <a6>   DW_AT_name        : (indirect string, offset: 0xb1a4e): uint32_t
    <aa>   DW_AT_decl_file   : 3
    <ab>   DW_AT_decl_line   : 48
    <ac>   DW_AT_decl_column : 20
    <ad>   DW_AT_type        : <0x75>
 <1><b1>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <b2>   DW_AT_type        : <0xa5>
 <1><b6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b7>   DW_AT_byte_size   : 4
    <b7>   DW_AT_type        : <0xbb>
 <1><bb>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <bc>   DW_AT_prototyped  : 1
    <bc>   DW_AT_sibling     : <0xc6>
 <2><c0>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <c1>   DW_AT_type        : <0xc6>
 <2><c5>: Abbrev Number: 0
 <1><c6>: Abbrev Number: 26 (DW_TAG_pointer_type)
    <c7>   DW_AT_byte_size   : 4
 <1><c8>: Abbrev Number: 6 (DW_TAG_base_type)
    <c9>   DW_AT_byte_size   : 1
    <ca>   DW_AT_encoding    : 8	(unsigned char)
    <cb>   DW_AT_name        : (indirect string, offset: 0x4e45d): char
 <1><cf>: Abbrev Number: 13 (DW_TAG_const_type)
    <d0>   DW_AT_type        : <0xc8>
 <1><d4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <d5>   DW_AT_byte_size   : 4
    <d5>   DW_AT_type        : <0xcf>
 <1><d9>: Abbrev Number: 14 (DW_TAG_structure_type)
    <da>   DW_AT_byte_size   : 16
    <db>   DW_AT_decl_file   : 4
    <dc>   DW_AT_decl_line   : 404
    <de>   DW_AT_decl_column : 9
    <de>   DW_AT_sibling     : <0x119>
 <2><e2>: Abbrev Number: 5 (DW_TAG_member)
    <e3>   DW_AT_name        : CCR
    <e7>   DW_AT_decl_file   : 4
    <e7>   DW_AT_decl_line   : 406
    <e9>   DW_AT_decl_column : 17
    <e9>   DW_AT_type        : <0xb1>
    <ed>   DW_AT_data_member_location: 0
 <2><ee>: Abbrev Number: 3 (DW_TAG_member)
    <ef>   DW_AT_name        : (indirect string, offset: 0xa013f): CNDTR
    <f3>   DW_AT_decl_file   : 4
    <f4>   DW_AT_decl_line   : 407
    <f6>   DW_AT_decl_column : 17
    <f7>   DW_AT_type        : <0xb1>
    <fb>   DW_AT_data_member_location: 4
 <2><fc>: Abbrev Number: 3 (DW_TAG_member)
    <fd>   DW_AT_name        : (indirect string, offset: 0xec7b7): CPAR
    <101>   DW_AT_decl_file   : 4
    <102>   DW_AT_decl_line   : 408
    <104>   DW_AT_decl_column : 17
    <105>   DW_AT_type        : <0xb1>
    <109>   DW_AT_data_member_location: 8
 <2><10a>: Abbrev Number: 3 (DW_TAG_member)
    <10b>   DW_AT_name        : (indirect string, offset: 0x87197): CMAR
    <10f>   DW_AT_decl_file   : 4
    <110>   DW_AT_decl_line   : 409
    <112>   DW_AT_decl_column : 17
    <113>   DW_AT_type        : <0xb1>
    <117>   DW_AT_data_member_location: 12
 <2><118>: Abbrev Number: 0
 <1><119>: Abbrev Number: 9 (DW_TAG_typedef)
    <11a>   DW_AT_name        : (indirect string, offset: 0xe7066): DMA_Channel_TypeDef
    <11e>   DW_AT_decl_file   : 4
    <11f>   DW_AT_decl_line   : 410
    <121>   DW_AT_decl_column : 3
    <121>   DW_AT_type        : <0xd9>
 <1><125>: Abbrev Number: 14 (DW_TAG_structure_type)
    <126>   DW_AT_byte_size   : 8
    <127>   DW_AT_decl_file   : 4
    <128>   DW_AT_decl_line   : 412
    <12a>   DW_AT_decl_column : 9
    <12a>   DW_AT_sibling     : <0x149>
 <2><12e>: Abbrev Number: 5 (DW_TAG_member)
    <12f>   DW_AT_name        : ISR
    <133>   DW_AT_decl_file   : 4
    <133>   DW_AT_decl_line   : 414
    <135>   DW_AT_decl_column : 17
    <135>   DW_AT_type        : <0xb1>
    <139>   DW_AT_data_member_location: 0
 <2><13a>: Abbrev Number: 3 (DW_TAG_member)
    <13b>   DW_AT_name        : (indirect string, offset: 0xab52f): IFCR
    <13f>   DW_AT_decl_file   : 4
    <140>   DW_AT_decl_line   : 415
    <142>   DW_AT_decl_column : 17
    <143>   DW_AT_type        : <0xb1>
    <147>   DW_AT_data_member_location: 4
 <2><148>: Abbrev Number: 0
 <1><149>: Abbrev Number: 9 (DW_TAG_typedef)
    <14a>   DW_AT_name        : (indirect string, offset: 0x584bd): DMA_TypeDef
    <14e>   DW_AT_decl_file   : 4
    <14f>   DW_AT_decl_line   : 416
    <151>   DW_AT_decl_column : 3
    <151>   DW_AT_type        : <0x125>
 <1><155>: Abbrev Number: 14 (DW_TAG_structure_type)
    <156>   DW_AT_byte_size   : 104
    <157>   DW_AT_decl_file   : 4
    <158>   DW_AT_decl_line   : 893
    <15a>   DW_AT_decl_column : 9
    <15a>   DW_AT_sibling     : <0x2b2>
 <2><15e>: Abbrev Number: 5 (DW_TAG_member)
    <15f>   DW_AT_name        : CR1
    <163>   DW_AT_decl_file   : 4
    <163>   DW_AT_decl_line   : 895
    <165>   DW_AT_decl_column : 17
    <165>   DW_AT_type        : <0xb1>
    <169>   DW_AT_data_member_location: 0
 <2><16a>: Abbrev Number: 5 (DW_TAG_member)
    <16b>   DW_AT_name        : CR2
    <16f>   DW_AT_decl_file   : 4
    <16f>   DW_AT_decl_line   : 896
    <171>   DW_AT_decl_column : 17
    <171>   DW_AT_type        : <0xb1>
    <175>   DW_AT_data_member_location: 4
 <2><176>: Abbrev Number: 3 (DW_TAG_member)
    <177>   DW_AT_name        : (indirect string, offset: 0x60c4): SMCR
    <17b>   DW_AT_decl_file   : 4
    <17c>   DW_AT_decl_line   : 897
    <17e>   DW_AT_decl_column : 17
    <17f>   DW_AT_type        : <0xb1>
    <183>   DW_AT_data_member_location: 8
 <2><184>: Abbrev Number: 3 (DW_TAG_member)
    <185>   DW_AT_name        : (indirect string, offset: 0x4e20f): DIER
    <189>   DW_AT_decl_file   : 4
    <18a>   DW_AT_decl_line   : 898
    <18c>   DW_AT_decl_column : 17
    <18d>   DW_AT_type        : <0xb1>
    <191>   DW_AT_data_member_location: 12
 <2><192>: Abbrev Number: 5 (DW_TAG_member)
    <193>   DW_AT_name        : SR
    <196>   DW_AT_decl_file   : 4
    <196>   DW_AT_decl_line   : 899
    <198>   DW_AT_decl_column : 17
    <198>   DW_AT_type        : <0xb1>
    <19c>   DW_AT_data_member_location: 16
 <2><19d>: Abbrev Number: 5 (DW_TAG_member)
    <19e>   DW_AT_name        : EGR
    <1a2>   DW_AT_decl_file   : 4
    <1a2>   DW_AT_decl_line   : 900
    <1a4>   DW_AT_decl_column : 17
    <1a4>   DW_AT_type        : <0xb1>
    <1a8>   DW_AT_data_member_location: 20
 <2><1a9>: Abbrev Number: 3 (DW_TAG_member)
    <1aa>   DW_AT_name        : (indirect string, offset: 0x86a65): CCMR1
    <1ae>   DW_AT_decl_file   : 4
    <1af>   DW_AT_decl_line   : 901
    <1b1>   DW_AT_decl_column : 17
    <1b2>   DW_AT_type        : <0xb1>
    <1b6>   DW_AT_data_member_location: 24
 <2><1b7>: Abbrev Number: 3 (DW_TAG_member)
    <1b8>   DW_AT_name        : (indirect string, offset: 0x60f53): CCMR2
    <1bc>   DW_AT_decl_file   : 4
    <1bd>   DW_AT_decl_line   : 902
    <1bf>   DW_AT_decl_column : 17
    <1c0>   DW_AT_type        : <0xb1>
    <1c4>   DW_AT_data_member_location: 28
 <2><1c5>: Abbrev Number: 3 (DW_TAG_member)
    <1c6>   DW_AT_name        : (indirect string, offset: 0x3adb2): CCER
    <1ca>   DW_AT_decl_file   : 4
    <1cb>   DW_AT_decl_line   : 903
    <1cd>   DW_AT_decl_column : 17
    <1ce>   DW_AT_type        : <0xb1>
    <1d2>   DW_AT_data_member_location: 32
 <2><1d3>: Abbrev Number: 5 (DW_TAG_member)
    <1d4>   DW_AT_name        : CNT
    <1d8>   DW_AT_decl_file   : 4
    <1d8>   DW_AT_decl_line   : 904
    <1da>   DW_AT_decl_column : 17
    <1da>   DW_AT_type        : <0xb1>
    <1de>   DW_AT_data_member_location: 36
 <2><1df>: Abbrev Number: 5 (DW_TAG_member)
    <1e0>   DW_AT_name        : PSC
    <1e4>   DW_AT_decl_file   : 4
    <1e4>   DW_AT_decl_line   : 905
    <1e6>   DW_AT_decl_column : 17
    <1e6>   DW_AT_type        : <0xb1>
    <1ea>   DW_AT_data_member_location: 40
 <2><1eb>: Abbrev Number: 5 (DW_TAG_member)
    <1ec>   DW_AT_name        : ARR
    <1f0>   DW_AT_decl_file   : 4
    <1f0>   DW_AT_decl_line   : 906
    <1f2>   DW_AT_decl_column : 17
    <1f2>   DW_AT_type        : <0xb1>
    <1f6>   DW_AT_data_member_location: 44
 <2><1f7>: Abbrev Number: 5 (DW_TAG_member)
    <1f8>   DW_AT_name        : RCR
    <1fc>   DW_AT_decl_file   : 4
    <1fc>   DW_AT_decl_line   : 907
    <1fe>   DW_AT_decl_column : 17
    <1fe>   DW_AT_type        : <0xb1>
    <202>   DW_AT_data_member_location: 48
 <2><203>: Abbrev Number: 3 (DW_TAG_member)
    <204>   DW_AT_name        : (indirect string, offset: 0x1cf14): CCR1
    <208>   DW_AT_decl_file   : 4
    <209>   DW_AT_decl_line   : 908
    <20b>   DW_AT_decl_column : 17
    <20c>   DW_AT_type        : <0xb1>
    <210>   DW_AT_data_member_location: 52
 <2><211>: Abbrev Number: 3 (DW_TAG_member)
    <212>   DW_AT_name        : (indirect string, offset: 0x65e9d): CCR2
    <216>   DW_AT_decl_file   : 4
    <217>   DW_AT_decl_line   : 909
    <219>   DW_AT_decl_column : 17
    <21a>   DW_AT_type        : <0xb1>
    <21e>   DW_AT_data_member_location: 56
 <2><21f>: Abbrev Number: 3 (DW_TAG_member)
    <220>   DW_AT_name        : (indirect string, offset: 0x4509d): CCR3
    <224>   DW_AT_decl_file   : 4
    <225>   DW_AT_decl_line   : 910
    <227>   DW_AT_decl_column : 17
    <228>   DW_AT_type        : <0xb1>
    <22c>   DW_AT_data_member_location: 60
 <2><22d>: Abbrev Number: 3 (DW_TAG_member)
    <22e>   DW_AT_name        : (indirect string, offset: 0xf997): CCR4
    <232>   DW_AT_decl_file   : 4
    <233>   DW_AT_decl_line   : 911
    <235>   DW_AT_decl_column : 17
    <236>   DW_AT_type        : <0xb1>
    <23a>   DW_AT_data_member_location: 64
 <2><23b>: Abbrev Number: 3 (DW_TAG_member)
    <23c>   DW_AT_name        : (indirect string, offset: 0x1eca6): BDTR
    <240>   DW_AT_decl_file   : 4
    <241>   DW_AT_decl_line   : 912
    <243>   DW_AT_decl_column : 17
    <244>   DW_AT_type        : <0xb1>
    <248>   DW_AT_data_member_location: 68
 <2><249>: Abbrev Number: 5 (DW_TAG_member)
    <24a>   DW_AT_name        : DCR
    <24e>   DW_AT_decl_file   : 4
    <24e>   DW_AT_decl_line   : 913
    <250>   DW_AT_decl_column : 17
    <250>   DW_AT_type        : <0xb1>
    <254>   DW_AT_data_member_location: 72
 <2><255>: Abbrev Number: 3 (DW_TAG_member)
    <256>   DW_AT_name        : (indirect string, offset: 0xb52ba): DMAR
    <25a>   DW_AT_decl_file   : 4
    <25b>   DW_AT_decl_line   : 914
    <25d>   DW_AT_decl_column : 17
    <25e>   DW_AT_type        : <0xb1>
    <262>   DW_AT_data_member_location: 76
 <2><263>: Abbrev Number: 5 (DW_TAG_member)
    <264>   DW_AT_name        : OR1
    <268>   DW_AT_decl_file   : 4
    <268>   DW_AT_decl_line   : 915
    <26a>   DW_AT_decl_column : 17
    <26a>   DW_AT_type        : <0xb1>
    <26e>   DW_AT_data_member_location: 80
 <2><26f>: Abbrev Number: 3 (DW_TAG_member)
    <270>   DW_AT_name        : (indirect string, offset: 0xd9d43): CCMR3
    <274>   DW_AT_decl_file   : 4
    <275>   DW_AT_decl_line   : 916
    <277>   DW_AT_decl_column : 17
    <278>   DW_AT_type        : <0xb1>
    <27c>   DW_AT_data_member_location: 84
 <2><27d>: Abbrev Number: 3 (DW_TAG_member)
    <27e>   DW_AT_name        : (indirect string, offset: 0x2b36e): CCR5
    <282>   DW_AT_decl_file   : 4
    <283>   DW_AT_decl_line   : 917
    <285>   DW_AT_decl_column : 17
    <286>   DW_AT_type        : <0xb1>
    <28a>   DW_AT_data_member_location: 88
 <2><28b>: Abbrev Number: 3 (DW_TAG_member)
    <28c>   DW_AT_name        : (indirect string, offset: 0xacdc3): CCR6
    <290>   DW_AT_decl_file   : 4
    <291>   DW_AT_decl_line   : 918
    <293>   DW_AT_decl_column : 17
    <294>   DW_AT_type        : <0xb1>
    <298>   DW_AT_data_member_location: 92
 <2><299>: Abbrev Number: 5 (DW_TAG_member)
    <29a>   DW_AT_name        : OR2
    <29e>   DW_AT_decl_file   : 4
    <29e>   DW_AT_decl_line   : 919
    <2a0>   DW_AT_decl_column : 17
    <2a0>   DW_AT_type        : <0xb1>
    <2a4>   DW_AT_data_member_location: 96
 <2><2a5>: Abbrev Number: 5 (DW_TAG_member)
    <2a6>   DW_AT_name        : OR3
    <2aa>   DW_AT_decl_file   : 4
    <2aa>   DW_AT_decl_line   : 920
    <2ac>   DW_AT_decl_column : 17
    <2ac>   DW_AT_type        : <0xb1>
    <2b0>   DW_AT_data_member_location: 100
 <2><2b1>: Abbrev Number: 0
 <1><2b2>: Abbrev Number: 9 (DW_TAG_typedef)
    <2b3>   DW_AT_name        : (indirect string, offset: 0xe7ef4): TIM_TypeDef
    <2b7>   DW_AT_decl_file   : 4
    <2b8>   DW_AT_decl_line   : 921
    <2ba>   DW_AT_decl_column : 3
    <2ba>   DW_AT_type        : <0x155>
 <1><2be>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <2bf>   DW_AT_encoding    : 7	(unsigned)
    <2c0>   DW_AT_byte_size   : 1
    <2c1>   DW_AT_type        : <0x59>
    <2c5>   DW_AT_decl_file   : 5
    <2c6>   DW_AT_decl_line   : 39
    <2c7>   DW_AT_decl_column : 1
    <2c8>   DW_AT_sibling     : <0x2e5>
 <2><2cc>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2cd>   DW_AT_name        : (indirect string, offset: 0x518e7): HAL_OK
    <2d1>   DW_AT_const_value : 0
 <2><2d2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2d3>   DW_AT_name        : (indirect string, offset: 0x99222): HAL_ERROR
    <2d7>   DW_AT_const_value : 1
 <2><2d8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2d9>   DW_AT_name        : (indirect string, offset: 0x2aa8c): HAL_BUSY
    <2dd>   DW_AT_const_value : 2
 <2><2de>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2df>   DW_AT_name        : (indirect string, offset: 0x46cc5): HAL_TIMEOUT
    <2e3>   DW_AT_const_value : 3
 <2><2e4>: Abbrev Number: 0
 <1><2e5>: Abbrev Number: 4 (DW_TAG_typedef)
    <2e6>   DW_AT_name        : (indirect string, offset: 0x2a76): HAL_StatusTypeDef
    <2ea>   DW_AT_decl_file   : 5
    <2eb>   DW_AT_decl_line   : 44
    <2ec>   DW_AT_decl_column : 3
    <2ed>   DW_AT_type        : <0x2be>
 <1><2f1>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <2f2>   DW_AT_encoding    : 7	(unsigned)
    <2f3>   DW_AT_byte_size   : 1
    <2f4>   DW_AT_type        : <0x59>
    <2f8>   DW_AT_decl_file   : 5
    <2f9>   DW_AT_decl_line   : 50
    <2fa>   DW_AT_decl_column : 1
    <2fb>   DW_AT_sibling     : <0x30c>
 <2><2ff>: Abbrev Number: 1 (DW_TAG_enumerator)
    <300>   DW_AT_name        : (indirect string, offset: 0xb4938): HAL_UNLOCKED
    <304>   DW_AT_const_value : 0
 <2><305>: Abbrev Number: 1 (DW_TAG_enumerator)
    <306>   DW_AT_name        : (indirect string, offset: 0xf4d60): HAL_LOCKED
    <30a>   DW_AT_const_value : 1
 <2><30b>: Abbrev Number: 0
 <1><30c>: Abbrev Number: 4 (DW_TAG_typedef)
    <30d>   DW_AT_name        : (indirect string, offset: 0x8fd7b): HAL_LockTypeDef
    <311>   DW_AT_decl_file   : 5
    <312>   DW_AT_decl_line   : 53
    <313>   DW_AT_decl_column : 3
    <314>   DW_AT_type        : <0x2f1>
 <1><318>: Abbrev Number: 15 (DW_TAG_array_type)
    <319>   DW_AT_type        : <0xa0>
    <31d>   DW_AT_sibling     : <0x328>
 <2><321>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <322>   DW_AT_type        : <0x31>
    <326>   DW_AT_upper_bound : 6
 <2><327>: Abbrev Number: 0
 <1><328>: Abbrev Number: 13 (DW_TAG_const_type)
    <329>   DW_AT_type        : <0x318>
 <1><32d>: Abbrev Number: 27 (DW_TAG_variable)
    <32e>   DW_AT_name        : (indirect string, offset: 0x2f8f9): CHANNEL_OFFSET_TAB
    <332>   DW_AT_decl_file   : 9
    <333>   DW_AT_decl_line   : 49
    <334>   DW_AT_decl_column : 22
    <335>   DW_AT_type        : <0x328>
    <339>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><33f>: Abbrev Number: 18 (DW_TAG_structure_type)
    <340>   DW_AT_byte_size   : 32
    <341>   DW_AT_decl_file   : 6
    <342>   DW_AT_decl_line   : 47
    <343>   DW_AT_decl_column : 9
    <343>   DW_AT_sibling     : <0x3b0>
 <2><347>: Abbrev Number: 2 (DW_TAG_member)
    <348>   DW_AT_name        : (indirect string, offset: 0xdb27e): Request
    <34c>   DW_AT_decl_file   : 6
    <34d>   DW_AT_decl_line   : 49
    <34e>   DW_AT_decl_column : 12
    <34f>   DW_AT_type        : <0xa5>
    <353>   DW_AT_data_member_location: 0
 <2><354>: Abbrev Number: 2 (DW_TAG_member)
    <355>   DW_AT_name        : (indirect string, offset: 0x59ea0): Direction
    <359>   DW_AT_decl_file   : 6
    <35a>   DW_AT_decl_line   : 52
    <35b>   DW_AT_decl_column : 12
    <35c>   DW_AT_type        : <0xa5>
    <360>   DW_AT_data_member_location: 4
 <2><361>: Abbrev Number: 2 (DW_TAG_member)
    <362>   DW_AT_name        : (indirect string, offset: 0x10707): PeriphInc
    <366>   DW_AT_decl_file   : 6
    <367>   DW_AT_decl_line   : 56
    <368>   DW_AT_decl_column : 12
    <369>   DW_AT_type        : <0xa5>
    <36d>   DW_AT_data_member_location: 8
 <2><36e>: Abbrev Number: 2 (DW_TAG_member)
    <36f>   DW_AT_name        : (indirect string, offset: 0x26218): MemInc
    <373>   DW_AT_decl_file   : 6
    <374>   DW_AT_decl_line   : 59
    <375>   DW_AT_decl_column : 12
    <376>   DW_AT_type        : <0xa5>
    <37a>   DW_AT_data_member_location: 12
 <2><37b>: Abbrev Number: 2 (DW_TAG_member)
    <37c>   DW_AT_name        : (indirect string, offset: 0x79f4d): PeriphDataAlignment
    <380>   DW_AT_decl_file   : 6
    <381>   DW_AT_decl_line   : 62
    <382>   DW_AT_decl_column : 12
    <383>   DW_AT_type        : <0xa5>
    <387>   DW_AT_data_member_location: 16
 <2><388>: Abbrev Number: 2 (DW_TAG_member)
    <389>   DW_AT_name        : (indirect string, offset: 0xdd307): MemDataAlignment
    <38d>   DW_AT_decl_file   : 6
    <38e>   DW_AT_decl_line   : 65
    <38f>   DW_AT_decl_column : 12
    <390>   DW_AT_type        : <0xa5>
    <394>   DW_AT_data_member_location: 20
 <2><395>: Abbrev Number: 2 (DW_TAG_member)
    <396>   DW_AT_name        : (indirect string, offset: 0xf895f): Mode
    <39a>   DW_AT_decl_file   : 6
    <39b>   DW_AT_decl_line   : 68
    <39c>   DW_AT_decl_column : 12
    <39d>   DW_AT_type        : <0xa5>
    <3a1>   DW_AT_data_member_location: 24
 <2><3a2>: Abbrev Number: 2 (DW_TAG_member)
    <3a3>   DW_AT_name        : (indirect string, offset: 0xf823d): Priority
    <3a7>   DW_AT_decl_file   : 6
    <3a8>   DW_AT_decl_line   : 73
    <3a9>   DW_AT_decl_column : 12
    <3aa>   DW_AT_type        : <0xa5>
    <3ae>   DW_AT_data_member_location: 28
 <2><3af>: Abbrev Number: 0
 <1><3b0>: Abbrev Number: 4 (DW_TAG_typedef)
    <3b1>   DW_AT_name        : (indirect string, offset: 0x41293): DMA_InitTypeDef
    <3b5>   DW_AT_decl_file   : 6
    <3b6>   DW_AT_decl_line   : 75
    <3b7>   DW_AT_decl_column : 3
    <3b8>   DW_AT_type        : <0x33f>
 <1><3bc>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <3bd>   DW_AT_encoding    : 7	(unsigned)
    <3be>   DW_AT_byte_size   : 1
    <3bf>   DW_AT_type        : <0x59>
    <3c3>   DW_AT_decl_file   : 6
    <3c4>   DW_AT_decl_line   : 81
    <3c5>   DW_AT_decl_column : 1
    <3c6>   DW_AT_sibling     : <0x3e3>
 <2><3ca>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3cb>   DW_AT_name        : (indirect string, offset: 0xb5eef): HAL_DMA_STATE_RESET
    <3cf>   DW_AT_const_value : 0
 <2><3d0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3d1>   DW_AT_name        : (indirect string, offset: 0x42703): HAL_DMA_STATE_READY
    <3d5>   DW_AT_const_value : 1
 <2><3d6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3d7>   DW_AT_name        : (indirect string, offset: 0xa9a2e): HAL_DMA_STATE_BUSY
    <3db>   DW_AT_const_value : 2
 <2><3dc>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3dd>   DW_AT_name        : (indirect string, offset: 0xf1000): HAL_DMA_STATE_TIMEOUT
    <3e1>   DW_AT_const_value : 3
 <2><3e2>: Abbrev Number: 0
 <1><3e3>: Abbrev Number: 4 (DW_TAG_typedef)
    <3e4>   DW_AT_name        : (indirect string, offset: 0xa35b1): HAL_DMA_StateTypeDef
    <3e8>   DW_AT_decl_file   : 6
    <3e9>   DW_AT_decl_line   : 86
    <3ea>   DW_AT_decl_column : 3
    <3eb>   DW_AT_type        : <0x3bc>
 <1><3ef>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <3f0>   DW_AT_type        : <0x3e3>
 <1><3f4>: Abbrev Number: 28 (DW_TAG_structure_type)
    <3f5>   DW_AT_name        : (indirect string, offset: 0xd02fe): __DMA_HandleTypeDef
    <3f9>   DW_AT_byte_size   : 72
    <3fa>   DW_AT_decl_file   : 6
    <3fb>   DW_AT_decl_line   : 113
    <3fc>   DW_AT_decl_column : 16
    <3fd>   DW_AT_sibling     : <0x49e>
 <2><401>: Abbrev Number: 2 (DW_TAG_member)
    <402>   DW_AT_name        : (indirect string, offset: 0x5e7b2): Instance
    <406>   DW_AT_decl_file   : 6
    <407>   DW_AT_decl_line   : 115
    <408>   DW_AT_decl_column : 36
    <409>   DW_AT_type        : <0x49e>
    <40d>   DW_AT_data_member_location: 0
 <2><40e>: Abbrev Number: 2 (DW_TAG_member)
    <40f>   DW_AT_name        : (indirect string, offset: 0xf90d5): Init
    <413>   DW_AT_decl_file   : 6
    <414>   DW_AT_decl_line   : 117
    <415>   DW_AT_decl_column : 35
    <416>   DW_AT_type        : <0x3b0>
    <41a>   DW_AT_data_member_location: 4
 <2><41b>: Abbrev Number: 2 (DW_TAG_member)
    <41c>   DW_AT_name        : (indirect string, offset: 0xae250): Lock
    <420>   DW_AT_decl_file   : 6
    <421>   DW_AT_decl_line   : 119
    <422>   DW_AT_decl_column : 35
    <423>   DW_AT_type        : <0x30c>
    <427>   DW_AT_data_member_location: 36
 <2><428>: Abbrev Number: 2 (DW_TAG_member)
    <429>   DW_AT_name        : (indirect string, offset: 0xfa648): State
    <42d>   DW_AT_decl_file   : 6
    <42e>   DW_AT_decl_line   : 121
    <42f>   DW_AT_decl_column : 35
    <430>   DW_AT_type        : <0x3ef>
    <434>   DW_AT_data_member_location: 37
 <2><435>: Abbrev Number: 2 (DW_TAG_member)
    <436>   DW_AT_name        : (indirect string, offset: 0x4bef1): Parent
    <43a>   DW_AT_decl_file   : 6
    <43b>   DW_AT_decl_line   : 123
    <43c>   DW_AT_decl_column : 11
    <43d>   DW_AT_type        : <0xc6>
    <441>   DW_AT_data_member_location: 40
 <2><442>: Abbrev Number: 2 (DW_TAG_member)
    <443>   DW_AT_name        : (indirect string, offset: 0xf3c85): XferCpltCallback
    <447>   DW_AT_decl_file   : 6
    <448>   DW_AT_decl_line   : 125
    <449>   DW_AT_decl_column : 11
    <44a>   DW_AT_type        : <0x4b3>
    <44e>   DW_AT_data_member_location: 44
 <2><44f>: Abbrev Number: 2 (DW_TAG_member)
    <450>   DW_AT_name        : (indirect string, offset: 0xbe060): XferHalfCpltCallback
    <454>   DW_AT_decl_file   : 6
    <455>   DW_AT_decl_line   : 127
    <456>   DW_AT_decl_column : 11
    <457>   DW_AT_type        : <0x4b3>
    <45b>   DW_AT_data_member_location: 48
 <2><45c>: Abbrev Number: 2 (DW_TAG_member)
    <45d>   DW_AT_name        : (indirect string, offset: 0x22d2b): XferErrorCallback
    <461>   DW_AT_decl_file   : 6
    <462>   DW_AT_decl_line   : 129
    <463>   DW_AT_decl_column : 11
    <464>   DW_AT_type        : <0x4b3>
    <468>   DW_AT_data_member_location: 52
 <2><469>: Abbrev Number: 2 (DW_TAG_member)
    <46a>   DW_AT_name        : (indirect string, offset: 0xe4bfd): XferAbortCallback
    <46e>   DW_AT_decl_file   : 6
    <46f>   DW_AT_decl_line   : 131
    <470>   DW_AT_decl_column : 11
    <471>   DW_AT_type        : <0x4b3>
    <475>   DW_AT_data_member_location: 56
 <2><476>: Abbrev Number: 2 (DW_TAG_member)
    <477>   DW_AT_name        : (indirect string, offset: 0xef5ca): ErrorCode
    <47b>   DW_AT_decl_file   : 6
    <47c>   DW_AT_decl_line   : 133
    <47d>   DW_AT_decl_column : 35
    <47e>   DW_AT_type        : <0xb1>
    <482>   DW_AT_data_member_location: 60
 <2><483>: Abbrev Number: 2 (DW_TAG_member)
    <484>   DW_AT_name        : (indirect string, offset: 0x62578): DmaBaseAddress
    <488>   DW_AT_decl_file   : 6
    <489>   DW_AT_decl_line   : 135
    <48a>   DW_AT_decl_column : 27
    <48b>   DW_AT_type        : <0x4b8>
    <48f>   DW_AT_data_member_location: 64
 <2><490>: Abbrev Number: 2 (DW_TAG_member)
    <491>   DW_AT_name        : (indirect string, offset: 0x325e5): ChannelIndex
    <495>   DW_AT_decl_file   : 6
    <496>   DW_AT_decl_line   : 137
    <497>   DW_AT_decl_column : 35
    <498>   DW_AT_type        : <0xa5>
    <49c>   DW_AT_data_member_location: 68
 <2><49d>: Abbrev Number: 0
 <1><49e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <49f>   DW_AT_byte_size   : 4
    <49f>   DW_AT_type        : <0x119>
 <1><4a3>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <4a4>   DW_AT_prototyped  : 1
    <4a4>   DW_AT_sibling     : <0x4ae>
 <2><4a8>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <4a9>   DW_AT_type        : <0x4ae>
 <2><4ad>: Abbrev Number: 0
 <1><4ae>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <4af>   DW_AT_byte_size   : 4
    <4af>   DW_AT_type        : <0x3f4>
 <1><4b3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <4b4>   DW_AT_byte_size   : 4
    <4b4>   DW_AT_type        : <0x4a3>
 <1><4b8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <4b9>   DW_AT_byte_size   : 4
    <4b9>   DW_AT_type        : <0x149>
 <1><4bd>: Abbrev Number: 4 (DW_TAG_typedef)
    <4be>   DW_AT_name        : (indirect string, offset: 0xd0300): DMA_HandleTypeDef
    <4c2>   DW_AT_decl_file   : 6
    <4c3>   DW_AT_decl_line   : 152
    <4c4>   DW_AT_decl_column : 3
    <4c5>   DW_AT_type        : <0x3f4>
 <1><4c9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <4ca>   DW_AT_byte_size   : 4
    <4ca>   DW_AT_type        : <0x4bd>
 <1><4ce>: Abbrev Number: 18 (DW_TAG_structure_type)
    <4cf>   DW_AT_byte_size   : 24
    <4d0>   DW_AT_decl_file   : 7
    <4d1>   DW_AT_decl_line   : 46
    <4d2>   DW_AT_decl_column : 9
    <4d2>   DW_AT_sibling     : <0x525>
 <2><4d6>: Abbrev Number: 2 (DW_TAG_member)
    <4d7>   DW_AT_name        : (indirect string, offset: 0xf729a): Prescaler
    <4db>   DW_AT_decl_file   : 7
    <4dc>   DW_AT_decl_line   : 48
    <4dd>   DW_AT_decl_column : 12
    <4de>   DW_AT_type        : <0xa5>
    <4e2>   DW_AT_data_member_location: 0
 <2><4e3>: Abbrev Number: 2 (DW_TAG_member)
    <4e4>   DW_AT_name        : (indirect string, offset: 0xde660): CounterMode
    <4e8>   DW_AT_decl_file   : 7
    <4e9>   DW_AT_decl_line   : 51
    <4ea>   DW_AT_decl_column : 12
    <4eb>   DW_AT_type        : <0xa5>
    <4ef>   DW_AT_data_member_location: 4
 <2><4f0>: Abbrev Number: 2 (DW_TAG_member)
    <4f1>   DW_AT_name        : (indirect string, offset: 0x100446): Period
    <4f5>   DW_AT_decl_file   : 7
    <4f6>   DW_AT_decl_line   : 54
    <4f7>   DW_AT_decl_column : 12
    <4f8>   DW_AT_type        : <0xa5>
    <4fc>   DW_AT_data_member_location: 8
 <2><4fd>: Abbrev Number: 2 (DW_TAG_member)
    <4fe>   DW_AT_name        : (indirect string, offset: 0x629e6): ClockDivision
    <502>   DW_AT_decl_file   : 7
    <503>   DW_AT_decl_line   : 58
    <504>   DW_AT_decl_column : 12
    <505>   DW_AT_type        : <0xa5>
    <509>   DW_AT_data_member_location: 12
 <2><50a>: Abbrev Number: 2 (DW_TAG_member)
    <50b>   DW_AT_name        : (indirect string, offset: 0xab61a): RepetitionCounter
    <50f>   DW_AT_decl_file   : 7
    <510>   DW_AT_decl_line   : 61
    <511>   DW_AT_decl_column : 12
    <512>   DW_AT_type        : <0xa5>
    <516>   DW_AT_data_member_location: 16
 <2><517>: Abbrev Number: 2 (DW_TAG_member)
    <518>   DW_AT_name        : (indirect string, offset: 0x1809d): AutoReloadPreload
    <51c>   DW_AT_decl_file   : 7
    <51d>   DW_AT_decl_line   : 72
    <51e>   DW_AT_decl_column : 12
    <51f>   DW_AT_type        : <0xa5>
    <523>   DW_AT_data_member_location: 20
 <2><524>: Abbrev Number: 0
 <1><525>: Abbrev Number: 4 (DW_TAG_typedef)
    <526>   DW_AT_name        : (indirect string, offset: 0x535bf): TIM_Base_InitTypeDef
    <52a>   DW_AT_decl_file   : 7
    <52b>   DW_AT_decl_line   : 74
    <52c>   DW_AT_decl_column : 3
    <52d>   DW_AT_type        : <0x4ce>
 <1><531>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <532>   DW_AT_encoding    : 7	(unsigned)
    <532>   DW_AT_byte_size   : 1
    <532>   DW_AT_type        : <0x59>
    <536>   DW_AT_decl_file   : 7
    <536>   DW_AT_decl_line   : 302
    <538>   DW_AT_decl_column : 1
    <538>   DW_AT_sibling     : <0x55b>
 <2><53c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <53d>   DW_AT_name        : (indirect string, offset: 0x7bc0d): HAL_TIM_STATE_RESET
    <541>   DW_AT_const_value : 0
 <2><542>: Abbrev Number: 1 (DW_TAG_enumerator)
    <543>   DW_AT_name        : (indirect string, offset: 0x8a68): HAL_TIM_STATE_READY
    <547>   DW_AT_const_value : 1
 <2><548>: Abbrev Number: 1 (DW_TAG_enumerator)
    <549>   DW_AT_name        : (indirect string, offset: 0x3cf16): HAL_TIM_STATE_BUSY
    <54d>   DW_AT_const_value : 2
 <2><54e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <54f>   DW_AT_name        : (indirect string, offset: 0xcc848): HAL_TIM_STATE_TIMEOUT
    <553>   DW_AT_const_value : 3
 <2><554>: Abbrev Number: 1 (DW_TAG_enumerator)
    <555>   DW_AT_name        : (indirect string, offset: 0x97245): HAL_TIM_STATE_ERROR
    <559>   DW_AT_const_value : 4
 <2><55a>: Abbrev Number: 0
 <1><55b>: Abbrev Number: 9 (DW_TAG_typedef)
    <55c>   DW_AT_name        : (indirect string, offset: 0xa1252): HAL_TIM_StateTypeDef
    <560>   DW_AT_decl_file   : 7
    <561>   DW_AT_decl_line   : 308
    <563>   DW_AT_decl_column : 3
    <563>   DW_AT_type        : <0x531>
 <1><567>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <568>   DW_AT_type        : <0x55b>
 <1><56c>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <56d>   DW_AT_encoding    : 7	(unsigned)
    <56d>   DW_AT_byte_size   : 1
    <56d>   DW_AT_type        : <0x59>
    <571>   DW_AT_decl_file   : 7
    <571>   DW_AT_decl_line   : 314
    <573>   DW_AT_decl_column : 1
    <573>   DW_AT_sibling     : <0x58a>
 <2><577>: Abbrev Number: 1 (DW_TAG_enumerator)
    <578>   DW_AT_name        : (indirect string, offset: 0xaccc8): HAL_TIM_CHANNEL_STATE_RESET
    <57c>   DW_AT_const_value : 0
 <2><57d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <57e>   DW_AT_name        : (indirect string, offset: 0xbbb50): HAL_TIM_CHANNEL_STATE_READY
    <582>   DW_AT_const_value : 1
 <2><583>: Abbrev Number: 1 (DW_TAG_enumerator)
    <584>   DW_AT_name        : (indirect string, offset: 0x9c76d): HAL_TIM_CHANNEL_STATE_BUSY
    <588>   DW_AT_const_value : 2
 <2><589>: Abbrev Number: 0
 <1><58a>: Abbrev Number: 9 (DW_TAG_typedef)
    <58b>   DW_AT_name        : (indirect string, offset: 0x32e1e): HAL_TIM_ChannelStateTypeDef
    <58f>   DW_AT_decl_file   : 7
    <590>   DW_AT_decl_line   : 318
    <592>   DW_AT_decl_column : 3
    <592>   DW_AT_type        : <0x56c>
 <1><596>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <597>   DW_AT_type        : <0x58a>
 <1><59b>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <59c>   DW_AT_encoding    : 7	(unsigned)
    <59c>   DW_AT_byte_size   : 1
    <59c>   DW_AT_type        : <0x59>
    <5a0>   DW_AT_decl_file   : 7
    <5a0>   DW_AT_decl_line   : 324
    <5a2>   DW_AT_decl_column : 1
    <5a2>   DW_AT_sibling     : <0x5b9>
 <2><5a6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5a7>   DW_AT_name        : (indirect string, offset: 0x501e): HAL_DMA_BURST_STATE_RESET
    <5ab>   DW_AT_const_value : 0
 <2><5ac>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5ad>   DW_AT_name        : (indirect string, offset: 0x869d1): HAL_DMA_BURST_STATE_READY
    <5b1>   DW_AT_const_value : 1
 <2><5b2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5b3>   DW_AT_name        : (indirect string, offset: 0xb744c): HAL_DMA_BURST_STATE_BUSY
    <5b7>   DW_AT_const_value : 2
 <2><5b8>: Abbrev Number: 0
 <1><5b9>: Abbrev Number: 9 (DW_TAG_typedef)
    <5ba>   DW_AT_name        : (indirect string, offset: 0x21033): HAL_TIM_DMABurstStateTypeDef
    <5be>   DW_AT_decl_file   : 7
    <5bf>   DW_AT_decl_line   : 328
    <5c1>   DW_AT_decl_column : 3
    <5c1>   DW_AT_type        : <0x59b>
 <1><5c5>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <5c6>   DW_AT_type        : <0x5b9>
 <1><5ca>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <5cb>   DW_AT_encoding    : 7	(unsigned)
    <5cb>   DW_AT_byte_size   : 1
    <5cb>   DW_AT_type        : <0x59>
    <5cf>   DW_AT_decl_file   : 7
    <5cf>   DW_AT_decl_line   : 334
    <5d1>   DW_AT_decl_column : 1
    <5d1>   DW_AT_sibling     : <0x600>
 <2><5d5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5d6>   DW_AT_name        : (indirect string, offset: 0x89a40): HAL_TIM_ACTIVE_CHANNEL_1
    <5da>   DW_AT_const_value : 1
 <2><5db>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5dc>   DW_AT_name        : (indirect string, offset: 0x89a59): HAL_TIM_ACTIVE_CHANNEL_2
    <5e0>   DW_AT_const_value : 2
 <2><5e1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5e2>   DW_AT_name        : (indirect string, offset: 0x89a72): HAL_TIM_ACTIVE_CHANNEL_3
    <5e6>   DW_AT_const_value : 4
 <2><5e7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5e8>   DW_AT_name        : (indirect string, offset: 0x89a8b): HAL_TIM_ACTIVE_CHANNEL_4
    <5ec>   DW_AT_const_value : 8
 <2><5ed>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5ee>   DW_AT_name        : (indirect string, offset: 0x89aa4): HAL_TIM_ACTIVE_CHANNEL_5
    <5f2>   DW_AT_const_value : 16
 <2><5f3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5f4>   DW_AT_name        : (indirect string, offset: 0x89abd): HAL_TIM_ACTIVE_CHANNEL_6
    <5f8>   DW_AT_const_value : 32
 <2><5f9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5fa>   DW_AT_name        : (indirect string, offset: 0x64077): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <5fe>   DW_AT_const_value : 0
 <2><5ff>: Abbrev Number: 0
 <1><600>: Abbrev Number: 9 (DW_TAG_typedef)
    <601>   DW_AT_name        : (indirect string, offset: 0x7f3a7): HAL_TIM_ActiveChannel
    <605>   DW_AT_decl_file   : 7
    <606>   DW_AT_decl_line   : 342
    <608>   DW_AT_decl_column : 3
    <608>   DW_AT_type        : <0x5ca>
 <1><60c>: Abbrev Number: 14 (DW_TAG_structure_type)
    <60d>   DW_AT_byte_size   : 76
    <60e>   DW_AT_decl_file   : 7
    <60f>   DW_AT_decl_line   : 350
    <611>   DW_AT_decl_column : 9
    <611>   DW_AT_sibling     : <0x694>
 <2><615>: Abbrev Number: 3 (DW_TAG_member)
    <616>   DW_AT_name        : (indirect string, offset: 0x5e7b2): Instance
    <61a>   DW_AT_decl_file   : 7
    <61b>   DW_AT_decl_line   : 353
    <61d>   DW_AT_decl_column : 39
    <61e>   DW_AT_type        : <0x694>
    <622>   DW_AT_data_member_location: 0
 <2><623>: Abbrev Number: 3 (DW_TAG_member)
    <624>   DW_AT_name        : (indirect string, offset: 0xf90d5): Init
    <628>   DW_AT_decl_file   : 7
    <629>   DW_AT_decl_line   : 354
    <62b>   DW_AT_decl_column : 38
    <62c>   DW_AT_type        : <0x525>
    <630>   DW_AT_data_member_location: 4
 <2><631>: Abbrev Number: 3 (DW_TAG_member)
    <632>   DW_AT_name        : (indirect string, offset: 0x7f3b5): Channel
    <636>   DW_AT_decl_file   : 7
    <637>   DW_AT_decl_line   : 355
    <639>   DW_AT_decl_column : 38
    <63a>   DW_AT_type        : <0x600>
    <63e>   DW_AT_data_member_location: 28
 <2><63f>: Abbrev Number: 3 (DW_TAG_member)
    <640>   DW_AT_name        : (indirect string, offset: 0x92622): hdma
    <644>   DW_AT_decl_file   : 7
    <645>   DW_AT_decl_line   : 356
    <647>   DW_AT_decl_column : 39
    <648>   DW_AT_type        : <0x699>
    <64c>   DW_AT_data_member_location: 32
 <2><64d>: Abbrev Number: 3 (DW_TAG_member)
    <64e>   DW_AT_name        : (indirect string, offset: 0xae250): Lock
    <652>   DW_AT_decl_file   : 7
    <653>   DW_AT_decl_line   : 358
    <655>   DW_AT_decl_column : 38
    <656>   DW_AT_type        : <0x30c>
    <65a>   DW_AT_data_member_location: 60
 <2><65b>: Abbrev Number: 3 (DW_TAG_member)
    <65c>   DW_AT_name        : (indirect string, offset: 0xfa648): State
    <660>   DW_AT_decl_file   : 7
    <661>   DW_AT_decl_line   : 359
    <663>   DW_AT_decl_column : 38
    <664>   DW_AT_type        : <0x567>
    <668>   DW_AT_data_member_location: 61
 <2><669>: Abbrev Number: 3 (DW_TAG_member)
    <66a>   DW_AT_name        : (indirect string, offset: 0xfa315): ChannelState
    <66e>   DW_AT_decl_file   : 7
    <66f>   DW_AT_decl_line   : 360
    <671>   DW_AT_decl_column : 38
    <672>   DW_AT_type        : <0x6b9>
    <676>   DW_AT_data_member_location: 62
 <2><677>: Abbrev Number: 3 (DW_TAG_member)
    <678>   DW_AT_name        : (indirect string, offset: 0xfa9b8): ChannelNState
    <67c>   DW_AT_decl_file   : 7
    <67d>   DW_AT_decl_line   : 361
    <67f>   DW_AT_decl_column : 38
    <680>   DW_AT_type        : <0x6ce>
    <684>   DW_AT_data_member_location: 68
 <2><685>: Abbrev Number: 3 (DW_TAG_member)
    <686>   DW_AT_name        : (indirect string, offset: 0xf9e7e): DMABurstState
    <68a>   DW_AT_decl_file   : 7
    <68b>   DW_AT_decl_line   : 362
    <68d>   DW_AT_decl_column : 38
    <68e>   DW_AT_type        : <0x5c5>
    <692>   DW_AT_data_member_location: 72
 <2><693>: Abbrev Number: 0
 <1><694>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <695>   DW_AT_byte_size   : 4
    <695>   DW_AT_type        : <0x2b2>
 <1><699>: Abbrev Number: 15 (DW_TAG_array_type)
    <69a>   DW_AT_type        : <0x4c9>
    <69e>   DW_AT_sibling     : <0x6a9>
 <2><6a2>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <6a3>   DW_AT_type        : <0x31>
    <6a7>   DW_AT_upper_bound : 6
 <2><6a8>: Abbrev Number: 0
 <1><6a9>: Abbrev Number: 15 (DW_TAG_array_type)
    <6aa>   DW_AT_type        : <0x596>
    <6ae>   DW_AT_sibling     : <0x6b9>
 <2><6b2>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <6b3>   DW_AT_type        : <0x31>
    <6b7>   DW_AT_upper_bound : 5
 <2><6b8>: Abbrev Number: 0
 <1><6b9>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <6ba>   DW_AT_type        : <0x6a9>
 <1><6be>: Abbrev Number: 15 (DW_TAG_array_type)
    <6bf>   DW_AT_type        : <0x596>
    <6c3>   DW_AT_sibling     : <0x6ce>
 <2><6c7>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <6c8>   DW_AT_type        : <0x31>
    <6cc>   DW_AT_upper_bound : 3
 <2><6cd>: Abbrev Number: 0
 <1><6ce>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <6cf>   DW_AT_type        : <0x6be>
 <1><6d3>: Abbrev Number: 9 (DW_TAG_typedef)
    <6d4>   DW_AT_name        : (indirect string, offset: 0x32ea6): TIM_HandleTypeDef
    <6d8>   DW_AT_decl_file   : 7
    <6d9>   DW_AT_decl_line   : 394
    <6db>   DW_AT_decl_column : 3
    <6db>   DW_AT_type        : <0x60c>
 <1><6df>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <6e0>   DW_AT_encoding    : 5	(signed)
    <6e1>   DW_AT_byte_size   : 4
    <6e2>   DW_AT_type        : <0x2a>
    <6e6>   DW_AT_decl_file   : 8
    <6e7>   DW_AT_decl_line   : 82
    <6e8>   DW_AT_decl_column : 14
    <6e9>   DW_AT_sibling     : <0x82b>
 <2><6ed>: Abbrev Number: 1 (DW_TAG_enumerator)
    <6ee>   DW_AT_name        : (indirect string, offset: 0x47de9): osPriorityNone
    <6f2>   DW_AT_const_value : 0
 <2><6f3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <6f4>   DW_AT_name        : (indirect string, offset: 0xd4516): osPriorityIdle
    <6f8>   DW_AT_const_value : 1
 <2><6f9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <6fa>   DW_AT_name        : (indirect string, offset: 0xe1a58): osPriorityLow
    <6fe>   DW_AT_const_value : 8
 <2><6ff>: Abbrev Number: 1 (DW_TAG_enumerator)
    <700>   DW_AT_name        : (indirect string, offset: 0xc38d3): osPriorityLow1
    <704>   DW_AT_const_value : 9
 <2><705>: Abbrev Number: 1 (DW_TAG_enumerator)
    <706>   DW_AT_name        : (indirect string, offset: 0xe8a15): osPriorityLow2
    <70a>   DW_AT_const_value : 10
 <2><70b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <70c>   DW_AT_name        : (indirect string, offset: 0xe8a24): osPriorityLow3
    <710>   DW_AT_const_value : 11
 <2><711>: Abbrev Number: 1 (DW_TAG_enumerator)
    <712>   DW_AT_name        : (indirect string, offset: 0xe8a33): osPriorityLow4
    <716>   DW_AT_const_value : 12
 <2><717>: Abbrev Number: 1 (DW_TAG_enumerator)
    <718>   DW_AT_name        : (indirect string, offset: 0xe8a42): osPriorityLow5
    <71c>   DW_AT_const_value : 13
 <2><71d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <71e>   DW_AT_name        : (indirect string, offset: 0xe8a51): osPriorityLow6
    <722>   DW_AT_const_value : 14
 <2><723>: Abbrev Number: 1 (DW_TAG_enumerator)
    <724>   DW_AT_name        : (indirect string, offset: 0x5a87d): osPriorityLow7
    <728>   DW_AT_const_value : 15
 <2><729>: Abbrev Number: 1 (DW_TAG_enumerator)
    <72a>   DW_AT_name        : (indirect string, offset: 0xeb3a4): osPriorityBelowNormal
    <72e>   DW_AT_const_value : 16
 <2><72f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <730>   DW_AT_name        : (indirect string, offset: 0x9260b): osPriorityBelowNormal1
    <734>   DW_AT_const_value : 17
 <2><735>: Abbrev Number: 1 (DW_TAG_enumerator)
    <736>   DW_AT_name        : (indirect string, offset: 0xcf577): osPriorityBelowNormal2
    <73a>   DW_AT_const_value : 18
 <2><73b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <73c>   DW_AT_name        : (indirect string, offset: 0xa71c6): osPriorityBelowNormal3
    <740>   DW_AT_const_value : 19
 <2><741>: Abbrev Number: 1 (DW_TAG_enumerator)
    <742>   DW_AT_name        : (indirect string, offset: 0xcf5ac): osPriorityBelowNormal4
    <746>   DW_AT_const_value : 20
 <2><747>: Abbrev Number: 1 (DW_TAG_enumerator)
    <748>   DW_AT_name        : (indirect string, offset: 0xcf5c3): osPriorityBelowNormal5
    <74c>   DW_AT_const_value : 21
 <2><74d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <74e>   DW_AT_name        : (indirect string, offset: 0xcf5da): osPriorityBelowNormal6
    <752>   DW_AT_const_value : 22
 <2><753>: Abbrev Number: 1 (DW_TAG_enumerator)
    <754>   DW_AT_name        : (indirect string, offset: 0xbae39): osPriorityBelowNormal7
    <758>   DW_AT_const_value : 23
 <2><759>: Abbrev Number: 1 (DW_TAG_enumerator)
    <75a>   DW_AT_name        : (indirect string, offset: 0xc739f): osPriorityNormal
    <75e>   DW_AT_const_value : 24
 <2><75f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <760>   DW_AT_name        : (indirect string, offset: 0x26ed7): osPriorityNormal1
    <764>   DW_AT_const_value : 25
 <2><765>: Abbrev Number: 1 (DW_TAG_enumerator)
    <766>   DW_AT_name        : (indirect string, offset: 0x26ee9): osPriorityNormal2
    <76a>   DW_AT_const_value : 26
 <2><76b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <76c>   DW_AT_name        : (indirect string, offset: 0x26efb): osPriorityNormal3
    <770>   DW_AT_const_value : 27
 <2><771>: Abbrev Number: 1 (DW_TAG_enumerator)
    <772>   DW_AT_name        : (indirect string, offset: 0x551d1): osPriorityNormal4
    <776>   DW_AT_const_value : 28
 <2><777>: Abbrev Number: 1 (DW_TAG_enumerator)
    <778>   DW_AT_name        : (indirect string, offset: 0x26f3c): osPriorityNormal5
    <77c>   DW_AT_const_value : 29
 <2><77d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <77e>   DW_AT_name        : (indirect string, offset: 0x26f4e): osPriorityNormal6
    <782>   DW_AT_const_value : 30
 <2><783>: Abbrev Number: 1 (DW_TAG_enumerator)
    <784>   DW_AT_name        : (indirect string, offset: 0x26f60): osPriorityNormal7
    <788>   DW_AT_const_value : 31
 <2><789>: Abbrev Number: 1 (DW_TAG_enumerator)
    <78a>   DW_AT_name        : (indirect string, offset: 0x9d50a): osPriorityAboveNormal
    <78e>   DW_AT_const_value : 32
 <2><78f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <790>   DW_AT_name        : (indirect string, offset: 0xf46bf): osPriorityAboveNormal1
    <794>   DW_AT_const_value : 33
 <2><795>: Abbrev Number: 1 (DW_TAG_enumerator)
    <796>   DW_AT_name        : (indirect string, offset: 0xe6980): osPriorityAboveNormal2
    <79a>   DW_AT_const_value : 34
 <2><79b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <79c>   DW_AT_name        : (indirect string, offset: 0xf46f6): osPriorityAboveNormal3
    <7a0>   DW_AT_const_value : 35
 <2><7a1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7a2>   DW_AT_name        : (indirect string, offset: 0xf470d): osPriorityAboveNormal4
    <7a6>   DW_AT_const_value : 36
 <2><7a7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7a8>   DW_AT_name        : (indirect string, offset: 0xe6a1c): osPriorityAboveNormal5
    <7ac>   DW_AT_const_value : 37
 <2><7ad>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7ae>   DW_AT_name        : (indirect string, offset: 0xf473a): osPriorityAboveNormal6
    <7b2>   DW_AT_const_value : 38
 <2><7b3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7b4>   DW_AT_name        : (indirect string, offset: 0xf4751): osPriorityAboveNormal7
    <7b8>   DW_AT_const_value : 39
 <2><7b9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7ba>   DW_AT_name        : (indirect string, offset: 0x56394): osPriorityHigh
    <7be>   DW_AT_const_value : 40
 <2><7bf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7c0>   DW_AT_name        : (indirect string, offset: 0xa26a3): osPriorityHigh1
    <7c4>   DW_AT_const_value : 41
 <2><7c5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7c6>   DW_AT_name        : (indirect string, offset: 0xa26b3): osPriorityHigh2
    <7ca>   DW_AT_const_value : 42
 <2><7cb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7cc>   DW_AT_name        : (indirect string, offset: 0xa26c3): osPriorityHigh3
    <7d0>   DW_AT_const_value : 43
 <2><7d1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7d2>   DW_AT_name        : (indirect string, offset: 0xa26d3): osPriorityHigh4
    <7d6>   DW_AT_const_value : 44
 <2><7d7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7d8>   DW_AT_name        : (indirect string, offset: 0x5b48c): osPriorityHigh5
    <7dc>   DW_AT_const_value : 45
 <2><7dd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7de>   DW_AT_name        : (indirect string, offset: 0xa270f): osPriorityHigh6
    <7e2>   DW_AT_const_value : 46
 <2><7e3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7e4>   DW_AT_name        : (indirect string, offset: 0xa271f): osPriorityHigh7
    <7e8>   DW_AT_const_value : 47
 <2><7e9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7ea>   DW_AT_name        : (indirect string, offset: 0xdde30): osPriorityRealtime
    <7ee>   DW_AT_const_value : 48
 <2><7ef>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7f0>   DW_AT_name        : (indirect string, offset: 0x9992b): osPriorityRealtime1
    <7f4>   DW_AT_const_value : 49
 <2><7f5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7f6>   DW_AT_name        : (indirect string, offset: 0x9993f): osPriorityRealtime2
    <7fa>   DW_AT_const_value : 50
 <2><7fb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7fc>   DW_AT_name        : (indirect string, offset: 0x99953): osPriorityRealtime3
    <800>   DW_AT_const_value : 51
 <2><801>: Abbrev Number: 1 (DW_TAG_enumerator)
    <802>   DW_AT_name        : (indirect string, offset: 0x99967): osPriorityRealtime4
    <806>   DW_AT_const_value : 52
 <2><807>: Abbrev Number: 1 (DW_TAG_enumerator)
    <808>   DW_AT_name        : (indirect string, offset: 0x9997b): osPriorityRealtime5
    <80c>   DW_AT_const_value : 53
 <2><80d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <80e>   DW_AT_name        : (indirect string, offset: 0x9998f): osPriorityRealtime6
    <812>   DW_AT_const_value : 54
 <2><813>: Abbrev Number: 1 (DW_TAG_enumerator)
    <814>   DW_AT_name        : (indirect string, offset: 0x999a3): osPriorityRealtime7
    <818>   DW_AT_const_value : 55
 <2><819>: Abbrev Number: 1 (DW_TAG_enumerator)
    <81a>   DW_AT_name        : (indirect string, offset: 0xea7): osPriorityISR
    <81e>   DW_AT_const_value : 56
 <2><81f>: Abbrev Number: 11 (DW_TAG_enumerator)
    <820>   DW_AT_name        : (indirect string, offset: 0xd7e17): osPriorityError
    <824>   DW_AT_const_value : -1
 <2><825>: Abbrev Number: 22 (DW_TAG_enumerator)
    <826>   DW_AT_name        : (indirect string, offset: 0xe8fd0): osPriorityReserved
    <82a>   DW_AT_const_value : 2147483647
 <2><82a>: Abbrev Number: 0
 <1><82b>: Abbrev Number: 4 (DW_TAG_typedef)
    <82c>   DW_AT_name        : (indirect string, offset: 0xcde4a): osPriority_t
    <830>   DW_AT_decl_file   : 8
    <831>   DW_AT_decl_line   : 136
    <832>   DW_AT_decl_column : 3
    <833>   DW_AT_type        : <0x6df>
 <1><837>: Abbrev Number: 4 (DW_TAG_typedef)
    <838>   DW_AT_name        : (indirect string, offset: 0x8432b): osThreadFunc_t
    <83c>   DW_AT_decl_file   : 8
    <83d>   DW_AT_decl_line   : 139
    <83e>   DW_AT_decl_column : 16
    <83f>   DW_AT_type        : <0xb6>
 <1><843>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <844>   DW_AT_encoding    : 5	(signed)
    <845>   DW_AT_byte_size   : 4
    <846>   DW_AT_type        : <0x2a>
    <84a>   DW_AT_decl_file   : 8
    <84b>   DW_AT_decl_line   : 176
    <84c>   DW_AT_decl_column : 14
    <84d>   DW_AT_sibling     : <0x881>
 <2><851>: Abbrev Number: 1 (DW_TAG_enumerator)
    <852>   DW_AT_name        : (indirect string, offset: 0xbc52c): osOK
    <856>   DW_AT_const_value : 0
 <2><857>: Abbrev Number: 11 (DW_TAG_enumerator)
    <858>   DW_AT_name        : (indirect string, offset: 0x72a73): osError
    <85c>   DW_AT_const_value : -1
 <2><85d>: Abbrev Number: 11 (DW_TAG_enumerator)
    <85e>   DW_AT_name        : (indirect string, offset: 0xdcb0b): osErrorTimeout
    <862>   DW_AT_const_value : -2
 <2><863>: Abbrev Number: 11 (DW_TAG_enumerator)
    <864>   DW_AT_name        : (indirect string, offset: 0xa064d): osErrorResource
    <868>   DW_AT_const_value : -3
 <2><869>: Abbrev Number: 11 (DW_TAG_enumerator)
    <86a>   DW_AT_name        : (indirect string, offset: 0x3ef34): osErrorParameter
    <86e>   DW_AT_const_value : -4
 <2><86f>: Abbrev Number: 11 (DW_TAG_enumerator)
    <870>   DW_AT_name        : (indirect string, offset: 0x2a3dd): osErrorNoMemory
    <874>   DW_AT_const_value : -5
 <2><875>: Abbrev Number: 11 (DW_TAG_enumerator)
    <876>   DW_AT_name        : (indirect string, offset: 0x416f4): osErrorISR
    <87a>   DW_AT_const_value : -6
 <2><87b>: Abbrev Number: 22 (DW_TAG_enumerator)
    <87c>   DW_AT_name        : (indirect string, offset: 0x7bb3d): osStatusReserved
    <880>   DW_AT_const_value : 2147483647
 <2><880>: Abbrev Number: 0
 <1><881>: Abbrev Number: 4 (DW_TAG_typedef)
    <882>   DW_AT_name        : (indirect string, offset: 0x52518): osStatus_t
    <886>   DW_AT_decl_file   : 8
    <887>   DW_AT_decl_line   : 185
    <888>   DW_AT_decl_column : 3
    <889>   DW_AT_type        : <0x843>
 <1><88d>: Abbrev Number: 4 (DW_TAG_typedef)
    <88e>   DW_AT_name        : (indirect string, offset: 0x2c539): osThreadId_t
    <892>   DW_AT_decl_file   : 8
    <893>   DW_AT_decl_line   : 189
    <894>   DW_AT_decl_column : 15
    <895>   DW_AT_type        : <0xc6>
 <1><899>: Abbrev Number: 4 (DW_TAG_typedef)
    <89a>   DW_AT_name        : (indirect string, offset: 0xa4acb): TZ_ModuleId_t
    <89e>   DW_AT_decl_file   : 8
    <89f>   DW_AT_decl_line   : 213
    <8a0>   DW_AT_decl_column : 18
    <8a1>   DW_AT_type        : <0xa5>
 <1><8a5>: Abbrev Number: 18 (DW_TAG_structure_type)
    <8a6>   DW_AT_byte_size   : 36
    <8a7>   DW_AT_decl_file   : 8
    <8a8>   DW_AT_decl_line   : 218
    <8a9>   DW_AT_decl_column : 9
    <8a9>   DW_AT_sibling     : <0x923>
 <2><8ad>: Abbrev Number: 2 (DW_TAG_member)
    <8ae>   DW_AT_name        : (indirect string, offset: 0x1c6f6): name
    <8b2>   DW_AT_decl_file   : 8
    <8b3>   DW_AT_decl_line   : 219
    <8b4>   DW_AT_decl_column : 33
    <8b5>   DW_AT_type        : <0xd4>
    <8b9>   DW_AT_data_member_location: 0
 <2><8ba>: Abbrev Number: 2 (DW_TAG_member)
    <8bb>   DW_AT_name        : (indirect string, offset: 0xa0357): attr_bits
    <8bf>   DW_AT_decl_file   : 8
    <8c0>   DW_AT_decl_line   : 220
    <8c1>   DW_AT_decl_column : 28
    <8c2>   DW_AT_type        : <0xa5>
    <8c6>   DW_AT_data_member_location: 4
 <2><8c7>: Abbrev Number: 2 (DW_TAG_member)
    <8c8>   DW_AT_name        : (indirect string, offset: 0x2f238): cb_mem
    <8cc>   DW_AT_decl_file   : 8
    <8cd>   DW_AT_decl_line   : 221
    <8ce>   DW_AT_decl_column : 30
    <8cf>   DW_AT_type        : <0xc6>
    <8d3>   DW_AT_data_member_location: 8
 <2><8d4>: Abbrev Number: 2 (DW_TAG_member)
    <8d5>   DW_AT_name        : (indirect string, offset: 0x6b214): cb_size
    <8d9>   DW_AT_decl_file   : 8
    <8da>   DW_AT_decl_line   : 222
    <8db>   DW_AT_decl_column : 30
    <8dc>   DW_AT_type        : <0xa5>
    <8e0>   DW_AT_data_member_location: 12
 <2><8e1>: Abbrev Number: 2 (DW_TAG_member)
    <8e2>   DW_AT_name        : (indirect string, offset: 0xde9c1): stack_mem
    <8e6>   DW_AT_decl_file   : 8
    <8e7>   DW_AT_decl_line   : 223
    <8e8>   DW_AT_decl_column : 27
    <8e9>   DW_AT_type        : <0xc6>
    <8ed>   DW_AT_data_member_location: 16
 <2><8ee>: Abbrev Number: 2 (DW_TAG_member)
    <8ef>   DW_AT_name        : (indirect string, offset: 0x99a08): stack_size
    <8f3>   DW_AT_decl_file   : 8
    <8f4>   DW_AT_decl_line   : 224
    <8f5>   DW_AT_decl_column : 27
    <8f6>   DW_AT_type        : <0xa5>
    <8fa>   DW_AT_data_member_location: 20
 <2><8fb>: Abbrev Number: 2 (DW_TAG_member)
    <8fc>   DW_AT_name        : (indirect string, offset: 0x60415): priority
    <900>   DW_AT_decl_file   : 8
    <901>   DW_AT_decl_line   : 225
    <902>   DW_AT_decl_column : 29
    <903>   DW_AT_type        : <0x82b>
    <907>   DW_AT_data_member_location: 24
 <2><908>: Abbrev Number: 2 (DW_TAG_member)
    <909>   DW_AT_name        : (indirect string, offset: 0x67cbe): tz_module
    <90d>   DW_AT_decl_file   : 8
    <90e>   DW_AT_decl_line   : 226
    <90f>   DW_AT_decl_column : 28
    <910>   DW_AT_type        : <0x899>
    <914>   DW_AT_data_member_location: 28
 <2><915>: Abbrev Number: 2 (DW_TAG_member)
    <916>   DW_AT_name        : (indirect string, offset: 0xdb5f4): reserved
    <91a>   DW_AT_decl_file   : 8
    <91b>   DW_AT_decl_line   : 227
    <91c>   DW_AT_decl_column : 29
    <91d>   DW_AT_type        : <0xa5>
    <921>   DW_AT_data_member_location: 32
 <2><922>: Abbrev Number: 0
 <1><923>: Abbrev Number: 4 (DW_TAG_typedef)
    <924>   DW_AT_name        : (indirect string, offset: 0x26ca2): osThreadAttr_t
    <928>   DW_AT_decl_file   : 8
    <929>   DW_AT_decl_line   : 228
    <92a>   DW_AT_decl_column : 3
    <92b>   DW_AT_type        : <0x8a5>
 <1><92f>: Abbrev Number: 13 (DW_TAG_const_type)
    <930>   DW_AT_type        : <0x923>
 <1><934>: Abbrev Number: 19 (DW_TAG_variable)
    <935>   DW_AT_name        : (indirect string, offset: 0xbee40): ulStatsTimerTicks
    <939>   DW_AT_decl_file   : 1
    <939>   DW_AT_decl_line   : 48
    <93a>   DW_AT_decl_column : 24
    <93b>   DW_AT_type        : <0x88>
    <93f>   DW_AT_external    : 1
    <93f>   DW_AT_location    : 5 byte block: 3 7c 0 0 20 	(DW_OP_addr: 2000007c)
 <1><945>: Abbrev Number: 29 (DW_TAG_variable)
    <946>   DW_AT_name        : (indirect string, offset: 0x9498e): htim7
    <94a>   DW_AT_decl_file   : 1
    <94b>   DW_AT_decl_line   : 49
    <94c>   DW_AT_decl_column : 26
    <94d>   DW_AT_type        : <0x6d3>
    <951>   DW_AT_external    : 1
    <951>   DW_AT_declaration : 1
 <1><951>: Abbrev Number: 19 (DW_TAG_variable)
    <952>   DW_AT_name        : (indirect string, offset: 0x609d5): defaultTaskHandle
    <956>   DW_AT_decl_file   : 1
    <956>   DW_AT_decl_line   : 52
    <957>   DW_AT_decl_column : 14
    <958>   DW_AT_type        : <0x88d>
    <95c>   DW_AT_external    : 1
    <95c>   DW_AT_location    : 5 byte block: 3 80 0 0 20 	(DW_OP_addr: 20000080)
 <1><962>: Abbrev Number: 19 (DW_TAG_variable)
    <963>   DW_AT_name        : (indirect string, offset: 0x6bff0): defaultTask_attributes
    <967>   DW_AT_decl_file   : 1
    <967>   DW_AT_decl_line   : 53
    <968>   DW_AT_decl_column : 22
    <969>   DW_AT_type        : <0x92f>
    <96d>   DW_AT_external    : 1
    <96d>   DW_AT_location    : 5 byte block: 3 ac 6c 0 8 	(DW_OP_addr: 8006cac)
 <1><973>: Abbrev Number: 20 (DW_TAG_subprogram)
    <974>   DW_AT_external    : 1
    <974>   DW_AT_name        : (indirect string, offset: 0xf265a): osDelay
    <978>   DW_AT_decl_file   : 8
    <979>   DW_AT_decl_line   : 459
    <97b>   DW_AT_decl_column : 12
    <97c>   DW_AT_prototyped  : 1
    <97c>   DW_AT_type        : <0x881>
    <980>   DW_AT_declaration : 1
    <980>   DW_AT_sibling     : <0x98a>
 <2><984>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <985>   DW_AT_type        : <0xa5>
 <2><989>: Abbrev Number: 0
 <1><98a>: Abbrev Number: 20 (DW_TAG_subprogram)
    <98b>   DW_AT_external    : 1
    <98b>   DW_AT_name        : (indirect string, offset: 0x878ef): osThreadNew
    <98f>   DW_AT_decl_file   : 8
    <990>   DW_AT_decl_line   : 349
    <992>   DW_AT_decl_column : 14
    <993>   DW_AT_prototyped  : 1
    <993>   DW_AT_type        : <0x88d>
    <997>   DW_AT_declaration : 1
    <997>   DW_AT_sibling     : <0x9ab>
 <2><99b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <99c>   DW_AT_type        : <0x837>
 <2><9a0>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <9a1>   DW_AT_type        : <0xc6>
 <2><9a5>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <9a6>   DW_AT_type        : <0x9ab>
 <2><9aa>: Abbrev Number: 0
 <1><9ab>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9ac>   DW_AT_byte_size   : 4
    <9ac>   DW_AT_type        : <0x92f>
 <1><9b0>: Abbrev Number: 20 (DW_TAG_subprogram)
    <9b1>   DW_AT_external    : 1
    <9b1>   DW_AT_name        : (indirect string, offset: 0x674e4): HAL_TIM_Base_Start_IT
    <9b5>   DW_AT_decl_file   : 7
    <9b6>   DW_AT_decl_line   : 2131
    <9b8>   DW_AT_decl_column : 19
    <9b9>   DW_AT_prototyped  : 1
    <9b9>   DW_AT_type        : <0x2e5>
    <9bd>   DW_AT_declaration : 1
    <9bd>   DW_AT_sibling     : <0x9c7>
 <2><9c1>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <9c2>   DW_AT_type        : <0x9c7>
 <2><9c6>: Abbrev Number: 0
 <1><9c7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <9c8>   DW_AT_byte_size   : 4
    <9c8>   DW_AT_type        : <0x6d3>
 <1><9cc>: Abbrev Number: 30 (DW_TAG_subprogram)
    <9cd>   DW_AT_external    : 1
    <9cd>   DW_AT_name        : (indirect string, offset: 0x35e91): StartDefaultTask
    <9d1>   DW_AT_decl_file   : 1
    <9d2>   DW_AT_decl_line   : 133
    <9d3>   DW_AT_decl_column : 6
    <9d4>   DW_AT_prototyped  : 1
    <9d4>   DW_AT_low_pc      : 0x8000554
    <9d8>   DW_AT_high_pc     : 0x10
    <9dc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9de>   DW_AT_call_all_tail_calls: 1
    <9de>   DW_AT_sibling     : <0x9f2>
 <2><9e2>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <9e3>   DW_AT_name        : (indirect string, offset: 0x343fc): argument
    <9e7>   DW_AT_decl_file   : 1
    <9e8>   DW_AT_decl_line   : 133
    <9e9>   DW_AT_decl_column : 29
    <9ea>   DW_AT_type        : <0xc6>
    <9ee>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><9f1>: Abbrev Number: 0
 <1><9f2>: Abbrev Number: 23 (DW_TAG_subprogram)
    <9f3>   DW_AT_external    : 1
    <9f3>   DW_AT_name        : (indirect string, offset: 0xc4d09): MX_FREERTOS_Init
    <9f7>   DW_AT_decl_file   : 1
    <9f7>   DW_AT_decl_line   : 91
    <9f8>   DW_AT_decl_column : 6
    <9f9>   DW_AT_prototyped  : 1
    <9f9>   DW_AT_low_pc      : 0x8000530
    <9fd>   DW_AT_high_pc     : 0x24
    <a01>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a03>   DW_AT_call_all_tail_calls: 1
 <1><a03>: Abbrev Number: 32 (DW_TAG_subprogram)
    <a04>   DW_AT_external    : 1
    <a04>   DW_AT_name        : (indirect string, offset: 0x6eb3b): getRunTimeCounterValue
    <a08>   DW_AT_decl_file   : 1
    <a09>   DW_AT_decl_line   : 80
    <a0a>   DW_AT_decl_column : 22
    <a0b>   DW_AT_prototyped  : 1
    <a0b>   DW_AT_type        : <0x81>
    <a0f>   DW_AT_low_pc      : 0x8000518
    <a13>   DW_AT_high_pc     : 0x18
    <a17>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a19>   DW_AT_call_all_calls: 1
 <1><a19>: Abbrev Number: 23 (DW_TAG_subprogram)
    <a1a>   DW_AT_external    : 1
    <a1a>   DW_AT_name        : (indirect string, offset: 0x32d77): configureTimerForRunTimeStats
    <a1e>   DW_AT_decl_file   : 1
    <a1e>   DW_AT_decl_line   : 74
    <a1f>   DW_AT_decl_column : 13
    <a20>   DW_AT_prototyped  : 1
    <a20>   DW_AT_low_pc      : 0x80004fc
    <a24>   DW_AT_high_pc     : 0x1c
    <a28>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a2a>   DW_AT_call_all_tail_calls: 1
 <1><a2a>: Abbrev Number: 0
  Compilation Unit @ offset 0xa2b:
   Length:        0xb6a (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x1ec
   Pointer Size:  4
 <0><a37>: Abbrev Number: 28 (DW_TAG_compile_unit)
    <a38>   DW_AT_producer    : (indirect string, offset: 0xf0ba8): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <a3c>   DW_AT_language    : 29	(C11)
    <a3d>   DW_AT_name        : (indirect string, offset: 0xf62e5): ../Core/Src/functions.c
    <a41>   DW_AT_comp_dir    : (indirect string, offset: 0x3956d): C:/Users/kaur_/Downloads/KTH/PRO1_Chandadeep_Kaur/Debug
    <a45>   DW_AT_ranges      : 0x31
    <a49>   DW_AT_low_pc      : 0
    <a4d>   DW_AT_stmt_list   : 0xa79
    <a51>   DW_AT_macros      : 0x257b1
 <1><a55>: Abbrev Number: 8 (DW_TAG_base_type)
    <a56>   DW_AT_byte_size   : 1
    <a57>   DW_AT_encoding    : 6	(signed char)
    <a58>   DW_AT_name        : (indirect string, offset: 0x7aed6): signed char
 <1><a5c>: Abbrev Number: 4 (DW_TAG_typedef)
    <a5d>   DW_AT_name        : (indirect string, offset: 0x465ad): __uint8_t
    <a61>   DW_AT_decl_file   : 2
    <a62>   DW_AT_decl_line   : 43
    <a63>   DW_AT_decl_column : 24
    <a64>   DW_AT_type        : <0xa68>
 <1><a68>: Abbrev Number: 8 (DW_TAG_base_type)
    <a69>   DW_AT_byte_size   : 1
    <a6a>   DW_AT_encoding    : 8	(unsigned char)
    <a6b>   DW_AT_name        : (indirect string, offset: 0xec597): unsigned char
 <1><a6f>: Abbrev Number: 8 (DW_TAG_base_type)
    <a70>   DW_AT_byte_size   : 2
    <a71>   DW_AT_encoding    : 5	(signed)
    <a72>   DW_AT_name        : (indirect string, offset: 0xb5a7e): short int
 <1><a76>: Abbrev Number: 4 (DW_TAG_typedef)
    <a77>   DW_AT_name        : (indirect string, offset: 0xf6653): __uint16_t
    <a7b>   DW_AT_decl_file   : 2
    <a7c>   DW_AT_decl_line   : 57
    <a7d>   DW_AT_decl_column : 25
    <a7e>   DW_AT_type        : <0xa82>
 <1><a82>: Abbrev Number: 8 (DW_TAG_base_type)
    <a83>   DW_AT_byte_size   : 2
    <a84>   DW_AT_encoding    : 7	(unsigned)
    <a85>   DW_AT_name        : (indirect string, offset: 0xeaa72): short unsigned int
 <1><a89>: Abbrev Number: 8 (DW_TAG_base_type)
    <a8a>   DW_AT_byte_size   : 4
    <a8b>   DW_AT_encoding    : 5	(signed)
    <a8c>   DW_AT_name        : (indirect string, offset: 0x1495d): long int
 <1><a90>: Abbrev Number: 4 (DW_TAG_typedef)
    <a91>   DW_AT_name        : (indirect string, offset: 0x9bfd5): __uint32_t
    <a95>   DW_AT_decl_file   : 2
    <a96>   DW_AT_decl_line   : 79
    <a97>   DW_AT_decl_column : 25
    <a98>   DW_AT_type        : <0xa9c>
 <1><a9c>: Abbrev Number: 8 (DW_TAG_base_type)
    <a9d>   DW_AT_byte_size   : 4
    <a9e>   DW_AT_encoding    : 7	(unsigned)
    <a9f>   DW_AT_name        : (indirect string, offset: 0x5cb20): long unsigned int
 <1><aa3>: Abbrev Number: 8 (DW_TAG_base_type)
    <aa4>   DW_AT_byte_size   : 8
    <aa5>   DW_AT_encoding    : 5	(signed)
    <aa6>   DW_AT_name        : (indirect string, offset: 0x6ef50): long long int
 <1><aaa>: Abbrev Number: 8 (DW_TAG_base_type)
    <aab>   DW_AT_byte_size   : 8
    <aac>   DW_AT_encoding    : 7	(unsigned)
    <aad>   DW_AT_name        : (indirect string, offset: 0x3297a): long long unsigned int
 <1><ab1>: Abbrev Number: 29 (DW_TAG_base_type)
    <ab2>   DW_AT_byte_size   : 4
    <ab3>   DW_AT_encoding    : 5	(signed)
    <ab4>   DW_AT_name        : int
 <1><ab8>: Abbrev Number: 8 (DW_TAG_base_type)
    <ab9>   DW_AT_byte_size   : 4
    <aba>   DW_AT_encoding    : 7	(unsigned)
    <abb>   DW_AT_name        : (indirect string, offset: 0x13e97): unsigned int
 <1><abf>: Abbrev Number: 4 (DW_TAG_typedef)
    <ac0>   DW_AT_name        : (indirect string, offset: 0x465af): uint8_t
    <ac4>   DW_AT_decl_file   : 3
    <ac5>   DW_AT_decl_line   : 24
    <ac6>   DW_AT_decl_column : 19
    <ac7>   DW_AT_type        : <0xa5c>
 <1><acb>: Abbrev Number: 19 (DW_TAG_const_type)
    <acc>   DW_AT_type        : <0xabf>
 <1><ad0>: Abbrev Number: 4 (DW_TAG_typedef)
    <ad1>   DW_AT_name        : (indirect string, offset: 0xfe04): uint16_t
    <ad5>   DW_AT_decl_file   : 3
    <ad6>   DW_AT_decl_line   : 36
    <ad7>   DW_AT_decl_column : 20
    <ad8>   DW_AT_type        : <0xa76>
 <1><adc>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <add>   DW_AT_type        : <0xad0>
 <1><ae1>: Abbrev Number: 4 (DW_TAG_typedef)
    <ae2>   DW_AT_name        : (indirect string, offset: 0xb1a4e): uint32_t
    <ae6>   DW_AT_decl_file   : 3
    <ae7>   DW_AT_decl_line   : 48
    <ae8>   DW_AT_decl_column : 20
    <ae9>   DW_AT_type        : <0xa90>
 <1><aed>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <aee>   DW_AT_type        : <0xae1>
 <1><af2>: Abbrev Number: 15 (DW_TAG_structure_type)
    <af3>   DW_AT_byte_size   : 16
    <af4>   DW_AT_decl_file   : 4
    <af4>   DW_AT_decl_line   : 404
    <af6>   DW_AT_decl_column : 9
    <af6>   DW_AT_sibling     : <0xb2b>
 <2><afa>: Abbrev Number: 10 (DW_TAG_member)
    <afb>   DW_AT_name        : CCR
    <aff>   DW_AT_decl_file   : 4
    <aff>   DW_AT_decl_line   : 406
    <b01>   DW_AT_decl_column : 17
    <b01>   DW_AT_type        : <0xaed>
    <b05>   DW_AT_data_member_location: 0
 <2><b06>: Abbrev Number: 5 (DW_TAG_member)
    <b07>   DW_AT_name        : (indirect string, offset: 0xa013f): CNDTR
    <b0b>   DW_AT_decl_file   : 4
    <b0b>   DW_AT_decl_line   : 407
    <b0d>   DW_AT_decl_column : 17
    <b0d>   DW_AT_type        : <0xaed>
    <b11>   DW_AT_data_member_location: 4
 <2><b12>: Abbrev Number: 5 (DW_TAG_member)
    <b13>   DW_AT_name        : (indirect string, offset: 0xec7b7): CPAR
    <b17>   DW_AT_decl_file   : 4
    <b17>   DW_AT_decl_line   : 408
    <b19>   DW_AT_decl_column : 17
    <b19>   DW_AT_type        : <0xaed>
    <b1d>   DW_AT_data_member_location: 8
 <2><b1e>: Abbrev Number: 5 (DW_TAG_member)
    <b1f>   DW_AT_name        : (indirect string, offset: 0x87197): CMAR
    <b23>   DW_AT_decl_file   : 4
    <b23>   DW_AT_decl_line   : 409
    <b25>   DW_AT_decl_column : 17
    <b25>   DW_AT_type        : <0xaed>
    <b29>   DW_AT_data_member_location: 12
 <2><b2a>: Abbrev Number: 0
 <1><b2b>: Abbrev Number: 16 (DW_TAG_typedef)
    <b2c>   DW_AT_name        : (indirect string, offset: 0xe7066): DMA_Channel_TypeDef
    <b30>   DW_AT_decl_file   : 4
    <b30>   DW_AT_decl_line   : 410
    <b32>   DW_AT_decl_column : 3
    <b32>   DW_AT_type        : <0xaf2>
 <1><b36>: Abbrev Number: 15 (DW_TAG_structure_type)
    <b37>   DW_AT_byte_size   : 8
    <b38>   DW_AT_decl_file   : 4
    <b38>   DW_AT_decl_line   : 412
    <b3a>   DW_AT_decl_column : 9
    <b3a>   DW_AT_sibling     : <0xb57>
 <2><b3e>: Abbrev Number: 10 (DW_TAG_member)
    <b3f>   DW_AT_name        : ISR
    <b43>   DW_AT_decl_file   : 4
    <b43>   DW_AT_decl_line   : 414
    <b45>   DW_AT_decl_column : 17
    <b45>   DW_AT_type        : <0xaed>
    <b49>   DW_AT_data_member_location: 0
 <2><b4a>: Abbrev Number: 5 (DW_TAG_member)
    <b4b>   DW_AT_name        : (indirect string, offset: 0xab52f): IFCR
    <b4f>   DW_AT_decl_file   : 4
    <b4f>   DW_AT_decl_line   : 415
    <b51>   DW_AT_decl_column : 17
    <b51>   DW_AT_type        : <0xaed>
    <b55>   DW_AT_data_member_location: 4
 <2><b56>: Abbrev Number: 0
 <1><b57>: Abbrev Number: 16 (DW_TAG_typedef)
    <b58>   DW_AT_name        : (indirect string, offset: 0x584bd): DMA_TypeDef
    <b5c>   DW_AT_decl_file   : 4
    <b5c>   DW_AT_decl_line   : 416
    <b5e>   DW_AT_decl_column : 3
    <b5e>   DW_AT_type        : <0xb36>
 <1><b62>: Abbrev Number: 15 (DW_TAG_structure_type)
    <b63>   DW_AT_byte_size   : 48
    <b64>   DW_AT_decl_file   : 4
    <b64>   DW_AT_decl_line   : 531
    <b66>   DW_AT_decl_column : 9
    <b66>   DW_AT_sibling     : <0xbef>
 <2><b6a>: Abbrev Number: 5 (DW_TAG_member)
    <b6b>   DW_AT_name        : (indirect string, offset: 0xf5d50): MODER
    <b6f>   DW_AT_decl_file   : 4
    <b6f>   DW_AT_decl_line   : 533
    <b71>   DW_AT_decl_column : 17
    <b71>   DW_AT_type        : <0xaed>
    <b75>   DW_AT_data_member_location: 0
 <2><b76>: Abbrev Number: 5 (DW_TAG_member)
    <b77>   DW_AT_name        : (indirect string, offset: 0xf65d6): OTYPER
    <b7b>   DW_AT_decl_file   : 4
    <b7b>   DW_AT_decl_line   : 534
    <b7d>   DW_AT_decl_column : 17
    <b7d>   DW_AT_type        : <0xaed>
    <b81>   DW_AT_data_member_location: 4
 <2><b82>: Abbrev Number: 5 (DW_TAG_member)
    <b83>   DW_AT_name        : (indirect string, offset: 0xf6712): OSPEEDR
    <b87>   DW_AT_decl_file   : 4
    <b87>   DW_AT_decl_line   : 535
    <b89>   DW_AT_decl_column : 17
    <b89>   DW_AT_type        : <0xaed>
    <b8d>   DW_AT_data_member_location: 8
 <2><b8e>: Abbrev Number: 5 (DW_TAG_member)
    <b8f>   DW_AT_name        : (indirect string, offset: 0xf64f8): PUPDR
    <b93>   DW_AT_decl_file   : 4
    <b93>   DW_AT_decl_line   : 536
    <b95>   DW_AT_decl_column : 17
    <b95>   DW_AT_type        : <0xaed>
    <b99>   DW_AT_data_member_location: 12
 <2><b9a>: Abbrev Number: 10 (DW_TAG_member)
    <b9b>   DW_AT_name        : IDR
    <b9f>   DW_AT_decl_file   : 4
    <b9f>   DW_AT_decl_line   : 537
    <ba1>   DW_AT_decl_column : 17
    <ba1>   DW_AT_type        : <0xaed>
    <ba5>   DW_AT_data_member_location: 16
 <2><ba6>: Abbrev Number: 10 (DW_TAG_member)
    <ba7>   DW_AT_name        : ODR
    <bab>   DW_AT_decl_file   : 4
    <bab>   DW_AT_decl_line   : 538
    <bad>   DW_AT_decl_column : 17
    <bad>   DW_AT_type        : <0xaed>
    <bb1>   DW_AT_data_member_location: 20
 <2><bb2>: Abbrev Number: 5 (DW_TAG_member)
    <bb3>   DW_AT_name        : (indirect string, offset: 0xf64f3): BSRR
    <bb7>   DW_AT_decl_file   : 4
    <bb7>   DW_AT_decl_line   : 539
    <bb9>   DW_AT_decl_column : 17
    <bb9>   DW_AT_type        : <0xaed>
    <bbd>   DW_AT_data_member_location: 24
 <2><bbe>: Abbrev Number: 5 (DW_TAG_member)
    <bbf>   DW_AT_name        : (indirect string, offset: 0xf6707): LCKR
    <bc3>   DW_AT_decl_file   : 4
    <bc3>   DW_AT_decl_line   : 540
    <bc5>   DW_AT_decl_column : 17
    <bc5>   DW_AT_type        : <0xaed>
    <bc9>   DW_AT_data_member_location: 28
 <2><bca>: Abbrev Number: 10 (DW_TAG_member)
    <bcb>   DW_AT_name        : AFR
    <bcf>   DW_AT_decl_file   : 4
    <bcf>   DW_AT_decl_line   : 541
    <bd1>   DW_AT_decl_column : 17
    <bd1>   DW_AT_type        : <0xbff>
    <bd5>   DW_AT_data_member_location: 32
 <2><bd6>: Abbrev Number: 10 (DW_TAG_member)
    <bd7>   DW_AT_name        : BRR
    <bdb>   DW_AT_decl_file   : 4
    <bdb>   DW_AT_decl_line   : 542
    <bdd>   DW_AT_decl_column : 17
    <bdd>   DW_AT_type        : <0xaed>
    <be1>   DW_AT_data_member_location: 40
 <2><be2>: Abbrev Number: 5 (DW_TAG_member)
    <be3>   DW_AT_name        : (indirect string, offset: 0xf5d56): ASCR
    <be7>   DW_AT_decl_file   : 4
    <be7>   DW_AT_decl_line   : 543
    <be9>   DW_AT_decl_column : 17
    <be9>   DW_AT_type        : <0xaed>
    <bed>   DW_AT_data_member_location: 44
 <2><bee>: Abbrev Number: 0
 <1><bef>: Abbrev Number: 20 (DW_TAG_array_type)
    <bf0>   DW_AT_type        : <0xaed>
    <bf4>   DW_AT_sibling     : <0xbff>
 <2><bf8>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <bf9>   DW_AT_type        : <0xab8>
    <bfd>   DW_AT_upper_bound : 1
 <2><bfe>: Abbrev Number: 0
 <1><bff>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <c00>   DW_AT_type        : <0xbef>
 <1><c04>: Abbrev Number: 16 (DW_TAG_typedef)
    <c05>   DW_AT_name        : (indirect string, offset: 0xf6885): GPIO_TypeDef
    <c09>   DW_AT_decl_file   : 4
    <c09>   DW_AT_decl_line   : 545
    <c0b>   DW_AT_decl_column : 3
    <c0b>   DW_AT_type        : <0xb62>
 <1><c0f>: Abbrev Number: 15 (DW_TAG_structure_type)
    <c10>   DW_AT_byte_size   : 28
    <c11>   DW_AT_decl_file   : 4
    <c11>   DW_AT_decl_line   : 842
    <c13>   DW_AT_decl_column : 9
    <c13>   DW_AT_sibling     : <0xc6a>
 <2><c17>: Abbrev Number: 10 (DW_TAG_member)
    <c18>   DW_AT_name        : CR1
    <c1c>   DW_AT_decl_file   : 4
    <c1c>   DW_AT_decl_line   : 844
    <c1e>   DW_AT_decl_column : 17
    <c1e>   DW_AT_type        : <0xaed>
    <c22>   DW_AT_data_member_location: 0
 <2><c23>: Abbrev Number: 10 (DW_TAG_member)
    <c24>   DW_AT_name        : CR2
    <c28>   DW_AT_decl_file   : 4
    <c28>   DW_AT_decl_line   : 845
    <c2a>   DW_AT_decl_column : 17
    <c2a>   DW_AT_type        : <0xaed>
    <c2e>   DW_AT_data_member_location: 4
 <2><c2f>: Abbrev Number: 10 (DW_TAG_member)
    <c30>   DW_AT_name        : SR
    <c33>   DW_AT_decl_file   : 4
    <c33>   DW_AT_decl_line   : 846
    <c35>   DW_AT_decl_column : 17
    <c35>   DW_AT_type        : <0xaed>
    <c39>   DW_AT_data_member_location: 8
 <2><c3a>: Abbrev Number: 10 (DW_TAG_member)
    <c3b>   DW_AT_name        : DR
    <c3e>   DW_AT_decl_file   : 4
    <c3e>   DW_AT_decl_line   : 847
    <c40>   DW_AT_decl_column : 17
    <c40>   DW_AT_type        : <0xaed>
    <c44>   DW_AT_data_member_location: 12
 <2><c45>: Abbrev Number: 5 (DW_TAG_member)
    <c46>   DW_AT_name        : (indirect string, offset: 0xf604e): CRCPR
    <c4a>   DW_AT_decl_file   : 4
    <c4a>   DW_AT_decl_line   : 848
    <c4c>   DW_AT_decl_column : 17
    <c4c>   DW_AT_type        : <0xaed>
    <c50>   DW_AT_data_member_location: 16
 <2><c51>: Abbrev Number: 5 (DW_TAG_member)
    <c52>   DW_AT_name        : (indirect string, offset: 0xf6471): RXCRCR
    <c56>   DW_AT_decl_file   : 4
    <c56>   DW_AT_decl_line   : 849
    <c58>   DW_AT_decl_column : 17
    <c58>   DW_AT_type        : <0xaed>
    <c5c>   DW_AT_data_member_location: 20
 <2><c5d>: Abbrev Number: 5 (DW_TAG_member)
    <c5e>   DW_AT_name        : (indirect string, offset: 0xf6357): TXCRCR
    <c62>   DW_AT_decl_file   : 4
    <c62>   DW_AT_decl_line   : 850
    <c64>   DW_AT_decl_column : 17
    <c64>   DW_AT_type        : <0xaed>
    <c68>   DW_AT_data_member_location: 24
 <2><c69>: Abbrev Number: 0
 <1><c6a>: Abbrev Number: 16 (DW_TAG_typedef)
    <c6b>   DW_AT_name        : (indirect string, offset: 0xf603a): SPI_TypeDef
    <c6f>   DW_AT_decl_file   : 4
    <c6f>   DW_AT_decl_line   : 851
    <c71>   DW_AT_decl_column : 3
    <c71>   DW_AT_type        : <0xc0f>
 <1><c75>: Abbrev Number: 8 (DW_TAG_base_type)
    <c76>   DW_AT_byte_size   : 8
    <c77>   DW_AT_encoding    : 4	(float)
    <c78>   DW_AT_name        : (indirect string, offset: 0x165f4): long double
 <1><c7c>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <c7d>   DW_AT_encoding    : 7	(unsigned)
    <c7d>   DW_AT_byte_size   : 1
    <c7d>   DW_AT_type        : <0xa68>
    <c81>   DW_AT_decl_file   : 5
    <c82>   DW_AT_decl_line   : 39
    <c83>   DW_AT_decl_column : 1
    <c83>   DW_AT_sibling     : <0xca0>
 <2><c87>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c88>   DW_AT_name        : (indirect string, offset: 0x518e7): HAL_OK
    <c8c>   DW_AT_const_value : 0
 <2><c8d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c8e>   DW_AT_name        : (indirect string, offset: 0x99222): HAL_ERROR
    <c92>   DW_AT_const_value : 1
 <2><c93>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c94>   DW_AT_name        : (indirect string, offset: 0x2aa8c): HAL_BUSY
    <c98>   DW_AT_const_value : 2
 <2><c99>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c9a>   DW_AT_name        : (indirect string, offset: 0x46cc5): HAL_TIMEOUT
    <c9e>   DW_AT_const_value : 3
 <2><c9f>: Abbrev Number: 0
 <1><ca0>: Abbrev Number: 4 (DW_TAG_typedef)
    <ca1>   DW_AT_name        : (indirect string, offset: 0x2a76): HAL_StatusTypeDef
    <ca5>   DW_AT_decl_file   : 5
    <ca6>   DW_AT_decl_line   : 44
    <ca7>   DW_AT_decl_column : 3
    <ca8>   DW_AT_type        : <0xc7c>
 <1><cac>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <cad>   DW_AT_encoding    : 7	(unsigned)
    <cad>   DW_AT_byte_size   : 1
    <cad>   DW_AT_type        : <0xa68>
    <cb1>   DW_AT_decl_file   : 5
    <cb2>   DW_AT_decl_line   : 50
    <cb3>   DW_AT_decl_column : 1
    <cb3>   DW_AT_sibling     : <0xcc4>
 <2><cb7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <cb8>   DW_AT_name        : (indirect string, offset: 0xb4938): HAL_UNLOCKED
    <cbc>   DW_AT_const_value : 0
 <2><cbd>: Abbrev Number: 2 (DW_TAG_enumerator)
    <cbe>   DW_AT_name        : (indirect string, offset: 0xf4d60): HAL_LOCKED
    <cc2>   DW_AT_const_value : 1
 <2><cc3>: Abbrev Number: 0
 <1><cc4>: Abbrev Number: 4 (DW_TAG_typedef)
    <cc5>   DW_AT_name        : (indirect string, offset: 0x8fd7b): HAL_LockTypeDef
    <cc9>   DW_AT_decl_file   : 5
    <cca>   DW_AT_decl_line   : 53
    <ccb>   DW_AT_decl_column : 3
    <ccc>   DW_AT_type        : <0xcac>
 <1><cd0>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <cd1>   DW_AT_encoding    : 7	(unsigned)
    <cd1>   DW_AT_byte_size   : 1
    <cd1>   DW_AT_type        : <0xa68>
    <cd5>   DW_AT_decl_file   : 6
    <cd6>   DW_AT_decl_line   : 68
    <cd7>   DW_AT_decl_column : 1
    <cd7>   DW_AT_sibling     : <0xce8>
 <2><cdb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <cdc>   DW_AT_name        : (indirect string, offset: 0xf5fec): GPIO_PIN_RESET
    <ce0>   DW_AT_const_value : 0
 <2><ce1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ce2>   DW_AT_name        : (indirect string, offset: 0xf6075): GPIO_PIN_SET
    <ce6>   DW_AT_const_value : 1
 <2><ce7>: Abbrev Number: 0
 <1><ce8>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce9>   DW_AT_name        : (indirect string, offset: 0xf68a5): GPIO_PinState
    <ced>   DW_AT_decl_file   : 6
    <cee>   DW_AT_decl_line   : 71
    <cef>   DW_AT_decl_column : 3
    <cf0>   DW_AT_type        : <0xcd0>
 <1><cf4>: Abbrev Number: 20 (DW_TAG_array_type)
    <cf5>   DW_AT_type        : <0xacb>
    <cf9>   DW_AT_sibling     : <0xd04>
 <2><cfd>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <cfe>   DW_AT_type        : <0xab8>
    <d02>   DW_AT_upper_bound : 6
 <2><d03>: Abbrev Number: 0
 <1><d04>: Abbrev Number: 19 (DW_TAG_const_type)
    <d05>   DW_AT_type        : <0xcf4>
 <1><d09>: Abbrev Number: 17 (DW_TAG_variable)
    <d0a>   DW_AT_name        : (indirect string, offset: 0x2f8f9): CHANNEL_OFFSET_TAB
    <d0e>   DW_AT_decl_file   : 12
    <d0f>   DW_AT_decl_line   : 49
    <d10>   DW_AT_decl_column : 22
    <d11>   DW_AT_type        : <0xd04>
    <d15>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><d1b>: Abbrev Number: 24 (DW_TAG_structure_type)
    <d1c>   DW_AT_byte_size   : 32
    <d1d>   DW_AT_decl_file   : 7
    <d1e>   DW_AT_decl_line   : 47
    <d1f>   DW_AT_decl_column : 9
    <d1f>   DW_AT_sibling     : <0xd8c>
 <2><d23>: Abbrev Number: 1 (DW_TAG_member)
    <d24>   DW_AT_name        : (indirect string, offset: 0xdb27e): Request
    <d28>   DW_AT_decl_file   : 7
    <d29>   DW_AT_decl_line   : 49
    <d2a>   DW_AT_decl_column : 12
    <d2b>   DW_AT_type        : <0xae1>
    <d2f>   DW_AT_data_member_location: 0
 <2><d30>: Abbrev Number: 1 (DW_TAG_member)
    <d31>   DW_AT_name        : (indirect string, offset: 0x59ea0): Direction
    <d35>   DW_AT_decl_file   : 7
    <d36>   DW_AT_decl_line   : 52
    <d37>   DW_AT_decl_column : 12
    <d38>   DW_AT_type        : <0xae1>
    <d3c>   DW_AT_data_member_location: 4
 <2><d3d>: Abbrev Number: 1 (DW_TAG_member)
    <d3e>   DW_AT_name        : (indirect string, offset: 0x10707): PeriphInc
    <d42>   DW_AT_decl_file   : 7
    <d43>   DW_AT_decl_line   : 56
    <d44>   DW_AT_decl_column : 12
    <d45>   DW_AT_type        : <0xae1>
    <d49>   DW_AT_data_member_location: 8
 <2><d4a>: Abbrev Number: 1 (DW_TAG_member)
    <d4b>   DW_AT_name        : (indirect string, offset: 0x26218): MemInc
    <d4f>   DW_AT_decl_file   : 7
    <d50>   DW_AT_decl_line   : 59
    <d51>   DW_AT_decl_column : 12
    <d52>   DW_AT_type        : <0xae1>
    <d56>   DW_AT_data_member_location: 12
 <2><d57>: Abbrev Number: 1 (DW_TAG_member)
    <d58>   DW_AT_name        : (indirect string, offset: 0x79f4d): PeriphDataAlignment
    <d5c>   DW_AT_decl_file   : 7
    <d5d>   DW_AT_decl_line   : 62
    <d5e>   DW_AT_decl_column : 12
    <d5f>   DW_AT_type        : <0xae1>
    <d63>   DW_AT_data_member_location: 16
 <2><d64>: Abbrev Number: 1 (DW_TAG_member)
    <d65>   DW_AT_name        : (indirect string, offset: 0xdd307): MemDataAlignment
    <d69>   DW_AT_decl_file   : 7
    <d6a>   DW_AT_decl_line   : 65
    <d6b>   DW_AT_decl_column : 12
    <d6c>   DW_AT_type        : <0xae1>
    <d70>   DW_AT_data_member_location: 20
 <2><d71>: Abbrev Number: 1 (DW_TAG_member)
    <d72>   DW_AT_name        : (indirect string, offset: 0xf895f): Mode
    <d76>   DW_AT_decl_file   : 7
    <d77>   DW_AT_decl_line   : 68
    <d78>   DW_AT_decl_column : 12
    <d79>   DW_AT_type        : <0xae1>
    <d7d>   DW_AT_data_member_location: 24
 <2><d7e>: Abbrev Number: 1 (DW_TAG_member)
    <d7f>   DW_AT_name        : (indirect string, offset: 0xf823d): Priority
    <d83>   DW_AT_decl_file   : 7
    <d84>   DW_AT_decl_line   : 73
    <d85>   DW_AT_decl_column : 12
    <d86>   DW_AT_type        : <0xae1>
    <d8a>   DW_AT_data_member_location: 28
 <2><d8b>: Abbrev Number: 0
 <1><d8c>: Abbrev Number: 4 (DW_TAG_typedef)
    <d8d>   DW_AT_name        : (indirect string, offset: 0x41293): DMA_InitTypeDef
    <d91>   DW_AT_decl_file   : 7
    <d92>   DW_AT_decl_line   : 75
    <d93>   DW_AT_decl_column : 3
    <d94>   DW_AT_type        : <0xd1b>
 <1><d98>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <d99>   DW_AT_encoding    : 7	(unsigned)
    <d99>   DW_AT_byte_size   : 1
    <d99>   DW_AT_type        : <0xa68>
    <d9d>   DW_AT_decl_file   : 7
    <d9e>   DW_AT_decl_line   : 81
    <d9f>   DW_AT_decl_column : 1
    <d9f>   DW_AT_sibling     : <0xdbc>
 <2><da3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <da4>   DW_AT_name        : (indirect string, offset: 0xb5eef): HAL_DMA_STATE_RESET
    <da8>   DW_AT_const_value : 0
 <2><da9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <daa>   DW_AT_name        : (indirect string, offset: 0x42703): HAL_DMA_STATE_READY
    <dae>   DW_AT_const_value : 1
 <2><daf>: Abbrev Number: 2 (DW_TAG_enumerator)
    <db0>   DW_AT_name        : (indirect string, offset: 0xa9a2e): HAL_DMA_STATE_BUSY
    <db4>   DW_AT_const_value : 2
 <2><db5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <db6>   DW_AT_name        : (indirect string, offset: 0xf1000): HAL_DMA_STATE_TIMEOUT
    <dba>   DW_AT_const_value : 3
 <2><dbb>: Abbrev Number: 0
 <1><dbc>: Abbrev Number: 4 (DW_TAG_typedef)
    <dbd>   DW_AT_name        : (indirect string, offset: 0xa35b1): HAL_DMA_StateTypeDef
    <dc1>   DW_AT_decl_file   : 7
    <dc2>   DW_AT_decl_line   : 86
    <dc3>   DW_AT_decl_column : 3
    <dc4>   DW_AT_type        : <0xd98>
 <1><dc8>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <dc9>   DW_AT_type        : <0xdbc>
 <1><dcd>: Abbrev Number: 22 (DW_TAG_structure_type)
    <dce>   DW_AT_name        : (indirect string, offset: 0xd02fe): __DMA_HandleTypeDef
    <dd2>   DW_AT_byte_size   : 72
    <dd3>   DW_AT_decl_file   : 7
    <dd4>   DW_AT_decl_line   : 113
    <dd5>   DW_AT_decl_column : 16
    <dd5>   DW_AT_sibling     : <0xe76>
 <2><dd9>: Abbrev Number: 1 (DW_TAG_member)
    <dda>   DW_AT_name        : (indirect string, offset: 0x5e7b2): Instance
    <dde>   DW_AT_decl_file   : 7
    <ddf>   DW_AT_decl_line   : 115
    <de0>   DW_AT_decl_column : 36
    <de1>   DW_AT_type        : <0xe76>
    <de5>   DW_AT_data_member_location: 0
 <2><de6>: Abbrev Number: 1 (DW_TAG_member)
    <de7>   DW_AT_name        : (indirect string, offset: 0xf90d5): Init
    <deb>   DW_AT_decl_file   : 7
    <dec>   DW_AT_decl_line   : 117
    <ded>   DW_AT_decl_column : 35
    <dee>   DW_AT_type        : <0xd8c>
    <df2>   DW_AT_data_member_location: 4
 <2><df3>: Abbrev Number: 1 (DW_TAG_member)
    <df4>   DW_AT_name        : (indirect string, offset: 0xae250): Lock
    <df8>   DW_AT_decl_file   : 7
    <df9>   DW_AT_decl_line   : 119
    <dfa>   DW_AT_decl_column : 35
    <dfb>   DW_AT_type        : <0xcc4>
    <dff>   DW_AT_data_member_location: 36
 <2><e00>: Abbrev Number: 1 (DW_TAG_member)
    <e01>   DW_AT_name        : (indirect string, offset: 0xfa648): State
    <e05>   DW_AT_decl_file   : 7
    <e06>   DW_AT_decl_line   : 121
    <e07>   DW_AT_decl_column : 35
    <e08>   DW_AT_type        : <0xdc8>
    <e0c>   DW_AT_data_member_location: 37
 <2><e0d>: Abbrev Number: 1 (DW_TAG_member)
    <e0e>   DW_AT_name        : (indirect string, offset: 0x4bef1): Parent
    <e12>   DW_AT_decl_file   : 7
    <e13>   DW_AT_decl_line   : 123
    <e14>   DW_AT_decl_column : 11
    <e15>   DW_AT_type        : <0xe7b>
    <e19>   DW_AT_data_member_location: 40
 <2><e1a>: Abbrev Number: 1 (DW_TAG_member)
    <e1b>   DW_AT_name        : (indirect string, offset: 0xf3c85): XferCpltCallback
    <e1f>   DW_AT_decl_file   : 7
    <e20>   DW_AT_decl_line   : 125
    <e21>   DW_AT_decl_column : 11
    <e22>   DW_AT_type        : <0xe8d>
    <e26>   DW_AT_data_member_location: 44
 <2><e27>: Abbrev Number: 1 (DW_TAG_member)
    <e28>   DW_AT_name        : (indirect string, offset: 0xbe060): XferHalfCpltCallback
    <e2c>   DW_AT_decl_file   : 7
    <e2d>   DW_AT_decl_line   : 127
    <e2e>   DW_AT_decl_column : 11
    <e2f>   DW_AT_type        : <0xe8d>
    <e33>   DW_AT_data_member_location: 48
 <2><e34>: Abbrev Number: 1 (DW_TAG_member)
    <e35>   DW_AT_name        : (indirect string, offset: 0x22d2b): XferErrorCallback
    <e39>   DW_AT_decl_file   : 7
    <e3a>   DW_AT_decl_line   : 129
    <e3b>   DW_AT_decl_column : 11
    <e3c>   DW_AT_type        : <0xe8d>
    <e40>   DW_AT_data_member_location: 52
 <2><e41>: Abbrev Number: 1 (DW_TAG_member)
    <e42>   DW_AT_name        : (indirect string, offset: 0xe4bfd): XferAbortCallback
    <e46>   DW_AT_decl_file   : 7
    <e47>   DW_AT_decl_line   : 131
    <e48>   DW_AT_decl_column : 11
    <e49>   DW_AT_type        : <0xe8d>
    <e4d>   DW_AT_data_member_location: 56
 <2><e4e>: Abbrev Number: 1 (DW_TAG_member)
    <e4f>   DW_AT_name        : (indirect string, offset: 0xef5ca): ErrorCode
    <e53>   DW_AT_decl_file   : 7
    <e54>   DW_AT_decl_line   : 133
    <e55>   DW_AT_decl_column : 35
    <e56>   DW_AT_type        : <0xaed>
    <e5a>   DW_AT_data_member_location: 60
 <2><e5b>: Abbrev Number: 1 (DW_TAG_member)
    <e5c>   DW_AT_name        : (indirect string, offset: 0x62578): DmaBaseAddress
    <e60>   DW_AT_decl_file   : 7
    <e61>   DW_AT_decl_line   : 135
    <e62>   DW_AT_decl_column : 27
    <e63>   DW_AT_type        : <0xe92>
    <e67>   DW_AT_data_member_location: 64
 <2><e68>: Abbrev Number: 1 (DW_TAG_member)
    <e69>   DW_AT_name        : (indirect string, offset: 0x325e5): ChannelIndex
    <e6d>   DW_AT_decl_file   : 7
    <e6e>   DW_AT_decl_line   : 137
    <e6f>   DW_AT_decl_column : 35
    <e70>   DW_AT_type        : <0xae1>
    <e74>   DW_AT_data_member_location: 68
 <2><e75>: Abbrev Number: 0
 <1><e76>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e77>   DW_AT_byte_size   : 4
    <e77>   DW_AT_type        : <0xb2b>
 <1><e7b>: Abbrev Number: 30 (DW_TAG_pointer_type)
    <e7c>   DW_AT_byte_size   : 4
 <1><e7d>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <e7e>   DW_AT_prototyped  : 1
    <e7e>   DW_AT_sibling     : <0xe88>
 <2><e82>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <e83>   DW_AT_type        : <0xe88>
 <2><e87>: Abbrev Number: 0
 <1><e88>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e89>   DW_AT_byte_size   : 4
    <e89>   DW_AT_type        : <0xdcd>
 <1><e8d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e8e>   DW_AT_byte_size   : 4
    <e8e>   DW_AT_type        : <0xe7d>
 <1><e92>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e93>   DW_AT_byte_size   : 4
    <e93>   DW_AT_type        : <0xb57>
 <1><e97>: Abbrev Number: 4 (DW_TAG_typedef)
    <e98>   DW_AT_name        : (indirect string, offset: 0xd0300): DMA_HandleTypeDef
    <e9c>   DW_AT_decl_file   : 7
    <e9d>   DW_AT_decl_line   : 152
    <e9e>   DW_AT_decl_column : 3
    <e9f>   DW_AT_type        : <0xdcd>
 <1><ea3>: Abbrev Number: 24 (DW_TAG_structure_type)
    <ea4>   DW_AT_byte_size   : 52
    <ea5>   DW_AT_decl_file   : 8
    <ea6>   DW_AT_decl_line   : 46
    <ea7>   DW_AT_decl_column : 9
    <ea7>   DW_AT_sibling     : <0xf55>
 <2><eab>: Abbrev Number: 1 (DW_TAG_member)
    <eac>   DW_AT_name        : (indirect string, offset: 0xf895f): Mode
    <eb0>   DW_AT_decl_file   : 8
    <eb1>   DW_AT_decl_line   : 48
    <eb2>   DW_AT_decl_column : 12
    <eb3>   DW_AT_type        : <0xae1>
    <eb7>   DW_AT_data_member_location: 0
 <2><eb8>: Abbrev Number: 1 (DW_TAG_member)
    <eb9>   DW_AT_name        : (indirect string, offset: 0x59ea0): Direction
    <ebd>   DW_AT_decl_file   : 8
    <ebe>   DW_AT_decl_line   : 51
    <ebf>   DW_AT_decl_column : 12
    <ec0>   DW_AT_type        : <0xae1>
    <ec4>   DW_AT_data_member_location: 4
 <2><ec5>: Abbrev Number: 1 (DW_TAG_member)
    <ec6>   DW_AT_name        : (indirect string, offset: 0xf65ae): DataSize
    <eca>   DW_AT_decl_file   : 8
    <ecb>   DW_AT_decl_line   : 54
    <ecc>   DW_AT_decl_column : 12
    <ecd>   DW_AT_type        : <0xae1>
    <ed1>   DW_AT_data_member_location: 8
 <2><ed2>: Abbrev Number: 1 (DW_TAG_member)
    <ed3>   DW_AT_name        : (indirect string, offset: 0xf5ffb): CLKPolarity
    <ed7>   DW_AT_decl_file   : 8
    <ed8>   DW_AT_decl_line   : 57
    <ed9>   DW_AT_decl_column : 12
    <eda>   DW_AT_type        : <0xae1>
    <ede>   DW_AT_data_member_location: 12
 <2><edf>: Abbrev Number: 1 (DW_TAG_member)
    <ee0>   DW_AT_name        : (indirect string, offset: 0xf6189): CLKPhase
    <ee4>   DW_AT_decl_file   : 8
    <ee5>   DW_AT_decl_line   : 60
    <ee6>   DW_AT_decl_column : 12
    <ee7>   DW_AT_type        : <0xae1>
    <eeb>   DW_AT_data_member_location: 16
 <2><eec>: Abbrev Number: 31 (DW_TAG_member)
    <eed>   DW_AT_name        : NSS
    <ef1>   DW_AT_decl_file   : 8
    <ef2>   DW_AT_decl_line   : 63
    <ef3>   DW_AT_decl_column : 12
    <ef4>   DW_AT_type        : <0xae1>
    <ef8>   DW_AT_data_member_location: 20
 <2><ef9>: Abbrev Number: 1 (DW_TAG_member)
    <efa>   DW_AT_name        : (indirect string, offset: 0xf5f20): BaudRatePrescaler
    <efe>   DW_AT_decl_file   : 8
    <eff>   DW_AT_decl_line   : 67
    <f00>   DW_AT_decl_column : 12
    <f01>   DW_AT_type        : <0xae1>
    <f05>   DW_AT_data_member_location: 24
 <2><f06>: Abbrev Number: 1 (DW_TAG_member)
    <f07>   DW_AT_name        : (indirect string, offset: 0xf6783): FirstBit
    <f0b>   DW_AT_decl_file   : 8
    <f0c>   DW_AT_decl_line   : 73
    <f0d>   DW_AT_decl_column : 12
    <f0e>   DW_AT_type        : <0xae1>
    <f12>   DW_AT_data_member_location: 28
 <2><f13>: Abbrev Number: 1 (DW_TAG_member)
    <f14>   DW_AT_name        : (indirect string, offset: 0xf6445): TIMode
    <f18>   DW_AT_decl_file   : 8
    <f19>   DW_AT_decl_line   : 76
    <f1a>   DW_AT_decl_column : 12
    <f1b>   DW_AT_type        : <0xae1>
    <f1f>   DW_AT_data_member_location: 32
 <2><f20>: Abbrev Number: 1 (DW_TAG_member)
    <f21>   DW_AT_name        : (indirect string, offset: 0xf6575): CRCCalculation
    <f25>   DW_AT_decl_file   : 8
    <f26>   DW_AT_decl_line   : 79
    <f27>   DW_AT_decl_column : 12
    <f28>   DW_AT_type        : <0xae1>
    <f2c>   DW_AT_data_member_location: 36
 <2><f2d>: Abbrev Number: 1 (DW_TAG_member)
    <f2e>   DW_AT_name        : (indirect string, offset: 0xf63ba): CRCPolynomial
    <f32>   DW_AT_decl_file   : 8
    <f33>   DW_AT_decl_line   : 82
    <f34>   DW_AT_decl_column : 12
    <f35>   DW_AT_type        : <0xae1>
    <f39>   DW_AT_data_member_location: 40
 <2><f3a>: Abbrev Number: 1 (DW_TAG_member)
    <f3b>   DW_AT_name        : (indirect string, offset: 0xf656b): CRCLength
    <f3f>   DW_AT_decl_file   : 8
    <f40>   DW_AT_decl_line   : 85
    <f41>   DW_AT_decl_column : 12
    <f42>   DW_AT_type        : <0xae1>
    <f46>   DW_AT_data_member_location: 44
 <2><f47>: Abbrev Number: 1 (DW_TAG_member)
    <f48>   DW_AT_name        : (indirect string, offset: 0xf6327): NSSPMode
    <f4c>   DW_AT_decl_file   : 8
    <f4d>   DW_AT_decl_line   : 89
    <f4e>   DW_AT_decl_column : 12
    <f4f>   DW_AT_type        : <0xae1>
    <f53>   DW_AT_data_member_location: 48
 <2><f54>: Abbrev Number: 0
 <1><f55>: Abbrev Number: 4 (DW_TAG_typedef)
    <f56>   DW_AT_name        : (indirect string, offset: 0xf5fbd): SPI_InitTypeDef
    <f5a>   DW_AT_decl_file   : 8
    <f5b>   DW_AT_decl_line   : 95
    <f5c>   DW_AT_decl_column : 3
    <f5d>   DW_AT_type        : <0xea3>
 <1><f61>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <f62>   DW_AT_encoding    : 7	(unsigned)
    <f62>   DW_AT_byte_size   : 1
    <f62>   DW_AT_type        : <0xa68>
    <f66>   DW_AT_decl_file   : 8
    <f67>   DW_AT_decl_line   : 101
    <f68>   DW_AT_decl_column : 1
    <f68>   DW_AT_sibling     : <0xf9d>
 <2><f6c>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f6d>   DW_AT_name        : (indirect string, offset: 0xf652e): HAL_SPI_STATE_RESET
    <f71>   DW_AT_const_value : 0
 <2><f72>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f73>   DW_AT_name        : (indirect string, offset: 0xf5fcd): HAL_SPI_STATE_READY
    <f77>   DW_AT_const_value : 1
 <2><f78>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f79>   DW_AT_name        : (indirect string, offset: 0xf5dd0): HAL_SPI_STATE_BUSY
    <f7d>   DW_AT_const_value : 2
 <2><f7e>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f7f>   DW_AT_name        : (indirect string, offset: 0xf63c8): HAL_SPI_STATE_BUSY_TX
    <f83>   DW_AT_const_value : 3
 <2><f84>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f85>   DW_AT_name        : (indirect string, offset: 0xf63a4): HAL_SPI_STATE_BUSY_RX
    <f89>   DW_AT_const_value : 4
 <2><f8a>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f8b>   DW_AT_name        : (indirect string, offset: 0xf5f76): HAL_SPI_STATE_BUSY_TX_RX
    <f8f>   DW_AT_const_value : 5
 <2><f90>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f91>   DW_AT_name        : (indirect string, offset: 0xf65c2): HAL_SPI_STATE_ERROR
    <f95>   DW_AT_const_value : 6
 <2><f96>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f97>   DW_AT_name        : (indirect string, offset: 0xf5f4c): HAL_SPI_STATE_ABORT
    <f9b>   DW_AT_const_value : 7
 <2><f9c>: Abbrev Number: 0
 <1><f9d>: Abbrev Number: 4 (DW_TAG_typedef)
    <f9e>   DW_AT_name        : (indirect string, offset: 0xf5dfa): HAL_SPI_StateTypeDef
    <fa2>   DW_AT_decl_file   : 8
    <fa3>   DW_AT_decl_line   : 110
    <fa4>   DW_AT_decl_column : 3
    <fa5>   DW_AT_type        : <0xf61>
 <1><fa9>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <faa>   DW_AT_type        : <0xf9d>
 <1><fae>: Abbrev Number: 22 (DW_TAG_structure_type)
    <faf>   DW_AT_name        : (indirect string, offset: 0xf6762): __SPI_HandleTypeDef
    <fb3>   DW_AT_byte_size   : 100
    <fb4>   DW_AT_decl_file   : 8
    <fb5>   DW_AT_decl_line   : 115
    <fb6>   DW_AT_decl_column : 16
    <fb6>   DW_AT_sibling     : <0x108b>
 <2><fba>: Abbrev Number: 1 (DW_TAG_member)
    <fbb>   DW_AT_name        : (indirect string, offset: 0x5e7b2): Instance
    <fbf>   DW_AT_decl_file   : 8
    <fc0>   DW_AT_decl_line   : 117
    <fc1>   DW_AT_decl_column : 31
    <fc2>   DW_AT_type        : <0x108b>
    <fc6>   DW_AT_data_member_location: 0
 <2><fc7>: Abbrev Number: 1 (DW_TAG_member)
    <fc8>   DW_AT_name        : (indirect string, offset: 0xf90d5): Init
    <fcc>   DW_AT_decl_file   : 8
    <fcd>   DW_AT_decl_line   : 119
    <fce>   DW_AT_decl_column : 30
    <fcf>   DW_AT_type        : <0xf55>
    <fd3>   DW_AT_data_member_location: 4
 <2><fd4>: Abbrev Number: 1 (DW_TAG_member)
    <fd5>   DW_AT_name        : (indirect string, offset: 0xf6330): pTxBuffPtr
    <fd9>   DW_AT_decl_file   : 8
    <fda>   DW_AT_decl_line   : 121
    <fdb>   DW_AT_decl_column : 31
    <fdc>   DW_AT_type        : <0x1090>
    <fe0>   DW_AT_data_member_location: 56
 <2><fe1>: Abbrev Number: 1 (DW_TAG_member)
    <fe2>   DW_AT_name        : (indirect string, offset: 0xf62b5): TxXferSize
    <fe6>   DW_AT_decl_file   : 8
    <fe7>   DW_AT_decl_line   : 123
    <fe8>   DW_AT_decl_column : 30
    <fe9>   DW_AT_type        : <0xad0>
    <fed>   DW_AT_data_member_location: 60
 <2><fee>: Abbrev Number: 1 (DW_TAG_member)
    <fef>   DW_AT_name        : (indirect string, offset: 0xf962d): TxXferCount
    <ff3>   DW_AT_decl_file   : 8
    <ff4>   DW_AT_decl_line   : 125
    <ff5>   DW_AT_decl_column : 30
    <ff6>   DW_AT_type        : <0xadc>
    <ffa>   DW_AT_data_member_location: 62
 <2><ffb>: Abbrev Number: 1 (DW_TAG_member)
    <ffc>   DW_AT_name        : (indirect string, offset: 0xf67d7): pRxBuffPtr
    <1000>   DW_AT_decl_file   : 8
    <1001>   DW_AT_decl_line   : 127
    <1002>   DW_AT_decl_column : 31
    <1003>   DW_AT_type        : <0x1095>
    <1007>   DW_AT_data_member_location: 64
 <2><1008>: Abbrev Number: 1 (DW_TAG_member)
